{"pages":[{"title":"About me","text":"Education Background Ph.D candidate in Physics, The University of Texas at Dallas (UTD), United States 08/2016 - Present Exchange program in Software Engineering, Pole Universitaire Leonard de Vinci, France 08/2015 - 02/2016 B. E. in Computer Science and Technology, special training class for computer software, Nanjing University of Aeronautics and Astronautics (NUAA), China 09/2012 - 06/2016 Reasearch/Work Experiences Research Assistant in Atomic, Molecular and Optical Physics, UTD 11/2016 - Present Research Intern, Micrsoft Research Quantum, Microsoft Redmond 06/2020 - 10/2020 Teaching Assistant, Department of Physics, UTD 08/2016 - 12/2017 Undergraduate Research Assistant, Department of Computer Science and Technology and Department of Applied Physics, NUAA 12/2012 - 07/2016 Reaserch Highlights Y.-J. Wu, J. Hou et al, Phys. Rev. Lett. 124, 227001 (2020). We discover an experimentally accessible platform, using a heterostructure of a quantum spin Hall insulator and an s-wave superconductor, for engineering Majorana corner and hinge modes, which are beneficial for topological quantum computing. J. Hou et al, Phys. Rev. Lett. 124, 073603 (2020). We develop the topological band theory for non-Hermitian hyperbolic metamaterials in continuous limits and reveal it as photonic topological semimetal with triply-degenerate point. M. E. Mossman, J. Hou et al, Nat. Commun. 10, 3381 (2019). Editors’ Highlights We theoretically propose and experimentally realize an atomtronic device called nonmagnetic unidirectional spin switch, in which the direction of spin flip can be controlled in an non-magnetic manner. H. Hu, J. Hou et al, Phys. Rev. Lett. 120, 240401 (2018). We classify the triply-degenerate point, a “new” kind of fermionic excitation, according to their topological properties. J. Hou et al, Phys. Rev. Lett. 120, 120401 (2018). Editors’ Suggestion We demonstrate a bosonic Josephson junction in momentum space. A relevant experimental realization of the proposed setup: T. M. Bersano, J. Hou, et al, Phys. Rev. A 99, 051602(R) (2019). J. Hou et al, Phys. Rev. Lett. 120, 060407 (2018). We propose a quantum state of matter called Superfluid-Quasicrystal, which is a superfluid but spontaneously forms quasicrystalline order in real space. See select news reports Newsweek, UTD News, Galileonet, Phys.org. Full publication list is available on Google Scholar. Professional ServicesI serve as invited referee/reviewer for Science, Nat. Commun., Phys. Rev. Lett., Phys. Rev. A, Phys. Rev. B, IEEE Access, zbMath, etc.","link":"/about/index.html"}],"posts":[{"title":"Beyond mean field theory: the renormalization group idea","text":"This is my term paper for PHYS $5313.001$ - Statistical Physics - S$17$. AbstractIn the class, we already study the phase transition in Ising model using mean field approximation and correspondingly examine its validity, where we find that mean field theory (MFT) actually breaks down when $$T\\sim T_c$$ and $d &lt; 4$ both hold. In other word, when the correlation length is sufficiently large, we have to properly take fluctuation into account. This requires a brand new way of thinking, that is, the renormalization group (RG) idea. In this term paper, we study those two different recipes, mainly used in modern physics to describe phase transitions and critical behaviors, on the ground of the materials discussed in the class. We extend our discussion to correlation functions and more critical exponentials. Again, we incorporate Ising model to present how those two theories (ideas) work. The main contents come from the textbooks. Introduction and backgroundMaterials may exhibit diverse functionalities depending on its constituents and external elements. Meanwhile, if one equally divides a given piece of material into two parts, the macroscopic properties such as density or magnetization, of this material should remain the same. However, this fails when one repeats the operations for many times. There exists a so-called correlation length, at which, the overall properties of one piece start to differ significantly from those of the original. In most common materials, we expect to have the correlation length in the order of few interatomic distances. This provides us with the convenience that even a small region of atoms (or molecules) should give a decent approximation. Nevertheless, correlation also can be affected by some external conditions like temperature, electromagnetic fields and pressure. The fact that some macroscopic properties may undergo a sudden change even when those external parameters vary smoothly actually marks a procedure we called phase transition. One possible form of phase transition is that there are multiple states on either sides around the critical point. At the critical point, all the state may co-exist, however, even slight deviation from the critical point will give an unique phase. Such that, we should be able to identify abrupt changes for some thermodynamic quantities when pass through proper region in parametric space. This is what we referred to as first-order phase transition. Generally, in a first-order transition process, the correlation length should remain finite. Another type of transition we would like to mention is continuous transition, where the correlation length is effectively infinite and consequently, the fluctuations are correlated over all length scale. In such transition procedure, different phases must become identical when the critical point is approached. Unlike first-order transition, which can be described by traditional perturbative in most cases, continuous phase transition is much more difficult to attack in the sense that an infinite correlation length brings too many degree of freedoms together. Renormalization group (RG) idea is introduced to solve such a strongly coupled system. Even though such a system is extremely complicated, some universalities have been identified in it. Near the critical point, many thermodynamic properties and even the correlation length show some power-law behaviors. More interesting, those powers (critical exponents) are only determined by, instead of the characteristic properties of the system, more generally physical features like symmetries of the Hamiltonian or the spatial dimensions. As a matter of fact, this exponential expressions are closely connected to both RG and scaling behavior. In this context, we mostly consider two widely used methods, mean field theory (MFT) and RG to describe phase transitions. We still incorporate the Ising model to start our discussion to be consistent with what we did in the class. Here, we hope to capture the essential ideas behind those two schemes by investigating the thermodynamic properties (free energy), critical exponents and correlation function. Although simple, Ising model is one of the most useful systems in statistical mechanics. Lower dimensional models can be exactly solved with some mathematical tricks, for example, using Pauli operators transformation to solve 1D Ising model with a transverse filed. A $2$D system can also be calculated exactly through some endeavors. Here, we will not go through the details about how to solve this model, instead, what we want is using minimal computing to extract maximal physics. The Ising model describe a system composed of $N$ classical spins $s(r) =\\pm 1$ for each lattice site $r$ of a $d$-dimensional spin. Then, one may write down the Hamiltonian as $H = - \\frac{1}{2} \\sum_{r,r’} J(r - r’)s(r)s(r’)+b\\sum_rs(r)$, where $J(r - r’)$ is the coupling strength of two spins, $b$ represents some external parameter (most commonly magnetic field) and the extra factor $\\frac{1}{2}$ is due to over-count of pair $(r, r’)$ and $(r’, r)$. We assume the readers are already familiar with the basic knowledge, for example, ferromagnet-paramagnet transition, critical temperature, etc., in this question. In this term paper, there are five critical exponential (including correlation length) we would like to discuss here: i) The specific heat when no external fields presenting, $C \\sim A\\vert t\\vert^{-\\alpha}$, ii) The spontaneous magnetization due to interaction $M_0=\\lim_{H\\to0+} M \\sim (-t)^\\beta$, iii) Susceptibility in zero field $\\chi = \\frac{\\partial M}{\\partial H}\\vert_{H=0} \\sim \\vert t\\vert^{-\\gamma}$, where $t=(T-T_c)/T_c$ is the normalized temperature, iv) The magnetization near critical point with non-zero magnetic field $M \\sim \\vert H/k_bT_c\\vert^{1/\\delta}$, v) A quantitative measurement of correlation length $\\xi$ can be given by the asymptotic behavior ($\\xi \\ll r$)of the correlation function $G(r) \\sim e^{r/\\xi}/r^{(d-1)/2}$, where $\\xi$ is introduced as $\\xi^2 = \\sum_r r^2G(r)/\\sum_rG(r)$. Mean field approachesFirst, we embark the mean field theory to study this model, starting from its thermodynamics. The partition function of the system is $Z = \\text{Tr} \\left( e^{\\frac{\\beta}{2} \\sum_{r,r’} J(r - r’)s(r)s(r’)+\\beta H \\sum_rs(r)} \\right)$, where we have replaced $b$ with $H$ to indicate a uniform magnetic field and $\\beta = 1/k_BT$ as usual. The model becomes trivial if we put the exchange coupling $J(r-r’)=0$ and one may calculate the magnetization $\\langle s \\rangle =\\tanh (\\beta H)$ as illustrated in any textbook. The main idea of mean field theory is quite simple and straightforward, using single particle partition function to approximate the interacting case. This requires us to linearize the square term appeared in exchange coupling. Meanwhile, in this case, we already know that $H$ will give a non-zero magnetization $M=\\langle s \\rangle$ and it will survive (in ferromagnetic phase) even one turns the magnetic filed off. With those hints, we linearize the quadratic term using $s(r) = M + \\left( s(r) - M\\right)$ and only keep the first or lower order terms with respect to $\\delta s(r)=s(r)-M$ $s(r)s(r’)= M\\left(s(r)+s(r’)\\right) - M^2 + O\\left((\\delta s(r))^2\\right)$. What we neglected here actually represents the interaction between spins at different sites, in this sense, we expect that mean field approximation only works when this interaction is relatively weak, that is, the correlation length is quite small. As we already did this in class, I will not go to details at this moment. Another useful result we derived in class is $f = a + b t M^2 + c M^4 + d H M$, where $a$, $b$, $c$ and $d$ are just constants and $t$ is the normalized temperature $t = (T-T_c)/T_c$. Surprisingly, even this simple relation can give us sufficient knowledge about the listed critical exponentials. First, when $H = 0$ and $t &lt; 0$, $f’(M_0) = 0$ gives $M_0 \\sim (-\\frac{b}{2c}t)^{1/2}$. One may readily conclude $\\beta=\\frac{1}{2}$. Similarly, we have $M\\sim cH/at$ for $t&gt;0$ giving $\\gamma = 1$ (note that $\\chi\\sim M$) and $M\\sim (cH/b)^{1/3}$ when $t=0$ indicating $\\delta=3$. For the specific heat, we need to study both situations. First, when $t&lt;0$, $f$ has one minimum $a$ located at $M=0$. On the other hand, $f$ has two minima of order $a + O((bt)^2/c)$ at $\\pm M_0$ when $t&lt;0$. This gives rise to the discontinuity of specific heat at $t=0$ and, as a matter of fact, can be directly ascribed to the fact that we did not account correctly for fluctuations in mean field theory. Nonetheless, we are safe to conclude $\\alpha = 0$. Even though we have used a somewhat coarse approach, it still provides us with the first glance at universality. All the critical potentials seem to be independent of any detail of the system and are only determined by the mathematical expression of free energy, that is, the dependence of free energy $f$ on order parameters $H$ and $M$. Taking a further step, we notice that symmetry is implicitly used when we write down the free energy (spin reversal symmetry in this case). So, here, we study the problem from a more general situation. Assuming we have $n$ order parameter $M_i$ with $O(n)$ symmetry, a direct generalization of the free energy we discussed above takes the form $f = a + b t \\sum_i M_i^2 + c \\left( \\sum_i M_i^2\\right)^2 + \\text{higher-order terms}$. The minimum $M_0 = \\left( (-bt/2c)^{1/2}, 0, … \\right)$ is fixed by the spontaneous symmetry break of $O(n)$ when $t&lt;0$, and again, we expand $f$ at $M_0$ to the second order $f = f_0 + 2 b \\vert t\\vert m_1^2$, where $m = M - M_0$. Only the modes $m_1$ remains finite while all other modes have effectively infinite correlation length and thus, decay as power laws. However, this is caused by symmetry break, not neglecting fluctuations. Since most thermodynamic properties and critical exponentials can be extracted from free energy, which can be expressed according to symmetry of order parameters. Now, we turn to use mean field approximation to study the correlation function to get the last critical exponential of interest, which has been calculated so far, the correlation length. The two-point spin-spin correlation function in high temperature region without external field is $$\\begin{align} G(r,r’) &amp;= \\langle s(r) s(r’)\\rangle \\ &amp;= \\frac{\\text{Tr} s(r)s(r’)e^{\\beta/2\\sum_{q,q’}J(q-q’)s(q)s(q’) }}{\\text{Tr} e^{\\beta/2\\sum_{q,q’} (q-q’)s(q)s(q’) }}. \\end{align} $$ To simplify this function, we first set $r’=0$ without loss of any generality, and note that $\\delta_{s(0),1}+\\delta_{s(0),-1}=1$, we have $G(r) = \\frac{\\text{Tr’} s(r)e^{\\beta/2\\sum_{q,q’}J(q-q’)s(q)s(q’) }}{\\text{Tr’} e^{\\beta/2\\sum_{q,q’}J(q-q’)s(q)s(q’) }} = M(r),$ where Tr’ represents taking trace over all spins expect $s(r)$ and $M(r)$ is just the magnetization at $r$ when the original is set to be $s(r)=1$. Now, if we apply mean field approximation as before and minimize the free energy, we obtain $G(r) = M(r) = \\tanh \\beta \\left( \\sum_{r’} J(r-r’) M(r’) \\right)$. It’s difficult to solve this equation, but if we take the large $r$ and small$M$ approximation, we can solve it in k-space analytically using Taylor expansion $G(k) \\sim \\frac{R^{-2}}{k^2 + \\xi^2}$, where $R^2 = \\sum_rr^2J(r)/\\sum_rJ(r)$ and $\\xi = Rt^{-1/2}$. Setting $k=0$ gives the susceptibility $G(0) \\sim t^{-1}$, which is consistent with $\\gamma=1$ we conclude in previous discussion. Now, transferring back to real space, $G(r) \\sim e^{-r/\\xi}/r^{(d-1)/2}$, this indicates that we can treat $\\xi \\sim t^{-1/2}$ as the correlation length. In fact, this correlation function can give us more information about other critical exponentials, however, we limit ourself to the aforementioned ones in this term paper. Since mean field theory relies on the assumption that $\\sum_{r’}J(r-r’)\\delta s(r)\\delta s(r’)$ is negligible comparing to the energy of the system, and, with the knowledge of correlation function, we may test its validity from $\\sum_{r’}J(r-r’)\\delta s(r)\\delta s(r’) \\approx J\\sum_{r’} G(r-r’)$. Nevertheless, as we already know the answer from class, I will skip this topic. Renormalization group ideaTo avoid prolix description, we start from one-dimensional Ising model with no Zeeman field to illustrate the basic idea of RG. The original idea “scaling” is suggested by L. Kadanoff\\cite{Kadanoff1966} to put neighbor real spins into a spin block and then, study the block system. The spin of each block is determined by counting the vote of only the center spins, that is $T(s’;s_1,s_2,s_3) = \\delta_{s’,s_2}$, where three real spins $s_1$, $s_2$ and $s_3$ are put in a spin block $s’$ and the vote is solely counted by the mid spin $s_2$. Such decimation process means our theory should only work at low temperature when all the spin in a block tend to have the same orientation. At first, we take a close look at two spin block within such a block spin system $s_1’(s_1,s_2,s_3)=s_2$ and $s_2’(s_4,s_5,s_6)=s_5$. Since it is a 1D system, we only need to take summation on the neighboring spins in different block, which gives the partition function as $Z_0’ = e^{Js_1’s_3}e^{Js_3s_4}e^{Js_4s_2’}.$ Note that, we have absorbed $\\beta$ into the coupling constant $J$. This can be further simplified using $e^{Js_3s_4}=\\cosh J(1+s_3s_4\\tanh J)$ and taking sum over $s_3$, $s_4$ $Z_0’=2^2 (\\cosh J)^3 (1+x^3s_1’s_2’). $ To invert this into the Boltzmann factor $e^{J’s_1’s_2’}$, one finds $Z_0’=e^{\\tanh^{-1} \\left( \\tanh^3 J\\right) s_1’ s_2’}$ Now, we are able to write the partition function of the whole system in theusual way $Z = \\text{Tr}’ e^{-H’(s’)}$ with the Hamiltonian $H’(s’) = N’ g(J) - J’\\sum_i s_i’s_{i+1}’.$ This $g(J)$ comes from short wave degrees of freedom and it onlybring some constant for the free energy, thus, will be neglected. The essential part of the RG process is $\\tanh J’ = \\tanh^3 J$, for convenience, we denote $x = \\tanh J$ and $x’ = \\tanh J’$. Note that, $x \\to 0+$ at high temperature and $x \\to 1-$ at low temperature. We call these two limits fixed points, as $x$ is invariant when two limits are taken exactly. However, any deviation will render $x$ goes to $0+$. In this sense, we may consider there is a so-called RG flow from $x=1-$ (unstable fixed-point with $J=\\inf$) to $x=0+$ (stable fixed-point with $J=0$). This gives a very important insight into this model, that is, in a short-range Ising model, it cannot be in an ordered state when $T &gt; 0$, and correspondingly, no phase transition can take place. This means, in principle, we cannot extract any information about critical exponentials like $\\alpha$ or $\\gamma$. Nevertheless, the power of RG exhibits itself through the fact that we may still study the correlation length $\\xi$. If one takes the lattice constant $a$ to be unit of length, $\\xi$ should only be a function of $J$. The RG transformation preserves long-range physics like the correlation length $\\xi(x)$, however, the lattice spacing is changed as $a \\to ab$ (in above case, b=3). Combing those two facts, one may conclude $\\xi(x’) = b^{-1} \\xi{x}$ as it is easy to generalize to the case $x’ = x^b$ under rescaling factor $b$. This can be solved as $\\xi(x) = \\frac{c}{\\ln x},$ where $c$ is some constant and the asymptotic behavior of correlation length is $\\xi \\sim e^{1/T}$ when $T \\to 0$. Following the same steps, one can apply the same reasoning for higher-dimensional Ising model and get $J’ \\sim b^{d-1} J$ with the dimension $d$. This seemingly trivial reason has an important implication. For $d&gt;1$, the two fixed points we discussed before are all stable, which indicates that there must be an unstable fixed point, between $T=0$ and $T=\\infty$, working as the source of RG flow (while the unstable ones acting like sinks). Such an unstable fixed point can be identified as critical point. Even now, without any knowledge of the free energy, we should be able to figure out some critical, but, this is not our primary aim here. We will develop a more general theory for the fixed point concepts and study the short-range Ising model systematically to get all aforementioned critical exponentials. Assume we have a RG transformation acting on a collection of coupling constants ${ K }$ as ${ K ‘} = R({K})$. We linearize this transformation near the fixed point ${ K^*}$ $K_a’-K_a^* \\sim \\sum_b T_{ab} (K_b - K_b^*),$ where we presume the GR transformation is differentiable and $T_{ab} = \\frac{\\partial K_a’}{\\partial K_b} \\vert_{K=K^\\ast}$. Now we define the scaling variable $u_i = \\sum_a \\phi_a^i (K_a-K_a^\\ast)$ and $\\phi_a^i$ and $\\lambda_i$ (or $\\lambda^i$) are eigenstates and eigenvalues of the matrix $T_{ab}$ respectively. One can readily write down the transformation law for $u_i$ $$\\begin{align} u_i’ &amp;= \\sum_a \\phi_a^i (K_a’ - K_a^*) \\ &amp;= \\sum_b \\lambda_i\\phi_b^i (K_b - K_b^*) \\ &amp;= \\lambda^i u_i \\end{align}. $$ In general, one can define quantities $y_i$ by $\\lambda^i = b^{y_i}$and $y_i$ are referred as RG eigenvalues. It can be distinguished as i) $y_i&gt;0$, then $u_i$ is relevant: RG transformation may drive it away from fixed point, ii) $y_i&lt;0$, then $u_i$ is irrelevant: RG transformation pulls it back to fixed point, iii) $y_i=0$, then $u_i$ is marginal: it is undetermined by our current analysis. For Ising model, if one study the geometry nearby the fixed point in a subspace spanned by two coupling constant ${K_1, K_2}$, it is clear that one of the parameters $K_1$ should be even (temperature-like and thus, referred as thermal scaling variable), while the other must be odd (magnetic scaling variable). The evenness or oddness is define through the spin flip symmetry $s \\to -s$. Note that, these actually correspond to the two factors that drive phase transition in Ising model, that is, the temperature and external magnetic field. Now, we can classify the all the eigenvalues of our RG transformation into three group: a relevant thermal scaling variable $u_t$, a relevant magnetic scaling variable $u_h$ and an infinite set of irrelevant scaling variables. Suppose that all $u_i$ are analytic and must vanish at $t=h=0$, we have $u_t = t/t_0 + O(t^2, h^2),~u_h=h/h_0+O(th).$ Similarly as we did for 1D situation, the free energy density (free energy per site) is $f({K}) = g({K}) + b^{-d} f({K’}),$ As we discussed before, the $g({K})$ term comes from short-wave degrees of freedom and plays no role in our problem of interest. This gives us a homogenous transformation law for the free energy $f({K}) = b^{-d} f({K’})$. After some computing, we finally come to the rescaling behavior of free energy $f(u_t, u_h) = \\vert u_t/u_{t0}\\vert^{d/y_t} f(\\pm u_{t0}, u_h\\vert u_t/u_{t0}\\vert^{-y_h/y_t}),$ where $\\vert b^{ny_t}u_t\\vert=u_{t0}$ and $n$ is the time we repeat the RG transformation. This can be simplified by replacing $u_t$ and $u_h$ by $t$ and $h$ $f_s(t,h) = \\vert\\frac{t}{t_0}\\vert^{d/y_t} \\Psi \\left( \\frac{h/h_0}{\\vert t/t_0\\vert^{y_h/y_t}} \\right),$ and $\\Psi$ is a general scaling function. Following by this scaling law forfree energy, we can extract the critical exponentials with easy: i) specific heat $C = \\partial^2f/\\partial t^2\\vert_{h=0} \\sim \\vert t\\vert^{d/y_t-2}$ gives $\\alpha = 2 - d/y_t$, ii) spontaneous magnetization $M_0 = \\partial f/\\partial h\\vert_{h=0} \\sim (-t)^{(d-y_h)/y_t}$ gives $\\beta=(d-y_h)/y_t$, iii) susceptibility in zero field $\\chi = \\partial^2 f/\\partial h^2\\vert_{h=0} \\sim \\vert t\\vert^{(d-y_h)/y_t}$ gives $\\gamma = (2y_h-d)/y_t$ iv) magnetization near critical point with non-zero magnetic field $M = \\frac{\\partial f}{\\partial h} = \\vert\\frac{t}{t_0}\\vert^{(d-y_h)/y_t} \\Psi’ \\left( \\frac{h/h_0}{\\vert t/t_0\\vert^{y_h/y_t}} \\right)$. For $M$ to be finite when $t \\to 0$, $\\Psi’(x)$ must have the form like $x^{d/y_h-1}$ when $x \\to \\inf$. This gives $M \\sim h^{d/y_h-1}$ at $t=0$ and thus, $\\delta = y_h/ (d-y_h)$. All the critical exponential we studied can be expressed as a function of the two RG eigenvalues and of course, the dimension $d$. If we do some algebra here, we can even find that $\\alpha + 2\\beta + \\gamma = 2,~\\alpha+\\beta(1+\\delta)=2$. Previously, when we use MFT to study the Ising model, we conclude that $\\alpha=0$, $\\beta=1/2$, $\\gamma=1$ and $\\delta=3$. Inserting all those numerics into the identity we just found, one may find that those identity are indeed satisfied. One may find that those results are independent of the rescaling factor $b$. It should be this way as the physics should not be affected by the way one rescales the system. However, from a mathematical point of view, the choice of $b$ does have influences on the expression of the transformation matrix $T_{ab}$ and thus, its eigenvalues and eigenstates. This dilemma can be eliminated as such. Any transformation can be generate by an infinitesimal transformation $b=1+\\delta l, \\delta b \\ll1$. Then, the coupling constants transfer like (to 1st order) $K_a \\to K_a + \\frac{dK_a}{dl} \\delta l,$ where $\\frac{dK_a}{dl} \\delta l = -\\beta_a({K})$ and $\\beta_a$ is RG beta function (similar with the one in QFT). Now, the fixed points are just zeros of the beta function and $T_{ab}=\\delta_{ab}+\\frac{dK_a}{dl} \\delta l$, giving its eigenvalues as $1+y_i\\delta l$. Thus, its property totally determined by the nature of the generator of transformation with $b$, not $b$ itself. ConclusionIn this term paper, we mainly study two different approaches, MFT and RG, to study critical behavior, with emphasize on the latter one. As we did in class, I incorporate the simplest Ising model to illustrate how those two methods work and how to use them to extract the critical exponentials. A relatively general formula for RG is discussed as well. AcknowledgementI thank Dr. H. Hu for helpful discussion. Reference Pathria, Raj Kumar. “Statistical mechanics.” (1972). Cardy, J. L. “Scaling and Renormalization in Statistical Mechanics.” Cambridge University Press, Cambridge 392 (1996): 397. Jaeger, Gregg. “The Ehrenfest classification of phase transitions: introduction and evolution.” Archive for history of exact sciences 53.1 (1998): 51-81. Pfeuty, Pierre. “The one-dimensional Ising model with a transverse field.” ANNALS of Physics 57.1 (1970): 79-90. Yang, Chen Ning. “The spontaneous magnetization of a two-dimensional Ising model.” Physical Review 85.5 (1952): 808. McCoy, Barry M., and Tai Tsun Wu. The two-dimensional Ising model. Courier Corporation, 2014. Kadanoff, Leo P. “Spin-spin correlations in the two-dimensional ising model.” Il Nuovo Cimento B (1965-1970) 44.2 (1966): 276-305.","link":"/2017/05/05/Beyond-mean-field-theory-the-renormalization-group-idea/"},{"title":"日常生活中的美语俚语&#x2F;习语","text":"记录一些曾经让自己一脸蒙蔽的美语俚语/习语。 take it with a grain of salt 跟别人讨论问题时候，对方突然用了这个短语，当时直接傻了。后来查了一下才发现是个挺常用的习语，意思是：regard something as exaggerated; believe only part of something。 fill in/out 这两个词混用了很久，以前都没注意。最近查了一下才知道前者英英常用，后者美英常用。不过其实混用也无所谓~ rest assured To be certain or confident. 一次manager对我说了这句话，当时愣住了。事后才想起来这个词的意思，当时看美剧《24小时》学到的。 中国程序员容易读错的单词 这次没有分享新单词，因为宅在家里，没什么机会学到新的单词。但是发现了一个很好的Github project：chinese-programmer-wrong-pronunciation. 分享一下，帮助大家纠正发音。 coronavirus 冠状病毒，想必大家都认识了。借一篇文章，顺便整理一下跟传染病相关的词汇。 传染病：communicable/infectious disease；流行病：epidemic；大规模疫病：pandemic；潜伏期：incubation period；检疫：quarantine；飞沫传播：droplet transmission；人兽共患病：zoonosis；人群易感性：herd susceptibility；医源性传播：iatrogenic transmission；隐性传播：covert infection；误诊，假阳性：false positive；漏诊，假阴性：false negative。 slingshot 弹弓。没啥好说的。。。 limerence the state of being infatuated or obsessed with another person, typically experienced involuntarily and characterized by a strong desire for reciprocation of one’s feelings but not primarily for a sexual relationship. frenemy a person with whom one is friendly despite a fundamental dislike or rivalry. carry a torch for someone To have unrequited feelings of love for someone. petrichor a pleasant smell that frequently accompanies the first rain after a long period of warm, dry weather. drop the ball 表示犯了错。If someone drops the ball, they make a mistake or do something silly。 ancestor money 这就是冥币了。。。。（我都学了些啥- -） growth mindset 今天刚刚听说这个词的时候，完全不知道是什么意思，也不知道是褒义还是贬义。所以特地搜索了一下，发现是指人相信自己是可以通过学习和努力变得更优秀。和fixed mindset相对应。 关于这个词，还有一个TED 演讲。演讲者Carol Dweck也是这个词的提出者。 complication 正常的意思大家都知道，但它还有个意思是“症状”或者“并发症”。引用Webster的定义：a secondary disease or condition developing in the course of a primary disease or condition。 在国内只学过“symptom”，所以这次得了胃炎gastritis，医生用这个词问我症状，当时就傻了。 补充几个跟胃炎相关的症状词汇：恶心nausea，胃胀bloating，腹泻diarrhea，便秘constipation。 以前知道greasy food就是油腻多糖的快餐，其实用fatty就可以形容食物很油腻了。 fasting是指禁食，当时学GRE背过，可是当医生突然对我用这个词的时候，我还是蒙了。 I’m gonna have a cow The phrase “to have a cow” is defined as “to be very worried, upset, or angry about something”. It also means to react very strongly and emotionally. hoot A hoot is defined as someone or something that is funny and entertaining goober 这个词是一个比较友善地说“傻子”的方式。有一种“这怕不是个傻子吧”的感觉。 hog 这个词对应“猪”的含义大多数人应该都听过，但它竟然还有“独占”，“抢”的意思。 get rear ended “被追尾”的意思。这个词的学习代价有点惨痛。。。。 touchy 表示一个比较让人“敏感易怒”的东西，比如a touchy subject。 PJ day A pajamas day, 意指比较悠闲，在家穿着睡衣过的一天。 show and tell 表演秀的意思。 wired 这个单词“有线的”这个意思很多人都知道，但是这里可以用成”I’m wired”。意思就是现在很疲惫或者精神紧张。如果前一天没睡好，第二天就可以这么说。 hitchhike 搭便车的意思，可以用作表示搭便车的人Hitchhiker。 xyz 提醒别人检查裤子拉链，“examine your zipper”。 clicker 鼠标是“mouse”这一点没毛病，但是美国人很少这么用，多数都叫clicker。听起来确实顺耳很多。 taiga 来源自俄语，意为亚寒带枫叶林 airy-fairy impractical and foolishly idealistic. 这个应该算是英式英语。 philematology 接吻学；我为什么会知道这种奇怪的词。。。。 look a gift horse in the mouth find fault with something that has been received as a gift or favor. dead as mutton 过时的；凉透的。 call a spade a spade speak plainly without avoiding unpleasant or embarrassing issues. have other fish to fry have other (or more important) matters to attend to. supercalifragilisticexpialidocious extraordinarily good; wonderful. 竟然还有一首歌叫这个名字 https://www.youtube.com/watch?v=1Pu1adxqUAg。","link":"/2016/08/04/American-english-slangs-and-idioms/"},{"title":"My favorite quotes","text":"We are all in the gutter, but some of us are looking at the stars. — Lady Windermere’s Fan by Oscar Wilde Try not. Do or do not. – Yoda When you look long into an abyss, the abyss looks into you. – Nietzsche The irrationality of a thing is not an argument against its existence, rather, a condition of it. – Nietzsche Nothing is so common as the wish to be remarkable. – Shakespeare When you have eliminated the impossible whatever remains, however improbable, must be the truth. – Sherlock Holmes Ideologies separate us, dreams and anguish bring us together. – Eugene Ionesco The individual has always had to struggle to keep from being overwhelmed by the tribe. – Nietzsche There are some that only employ words for the purpose of disguising their thoughts. – Voltaire Whoever undertakes to set himself up as judge in the field of truth and knowledge is shipwrecked by the laughter of the gods. – Albert Einstein In a time of universal deceit, telling the truth is a revolutionary act. – George Orwell No man needs a vacation so much as the man who has just had one. – Elbert Hubbard The basis of shame is not some personal mistake of ours, but… that this humiliation is seen by everyone. – Milan Kundera Our life is made by the death of others. – Leonardo da Vinci Lasciate ogni speranza, voi ch’entrate.（Abandon hope, all ye who enter here). – Dante Savages we call them because their manners differ from ours. – Benjamin Franklin What really raises one’s indignation against suffering is not suffering intrinsically but the senselessness of suffering. – Friedrich Nietzsche All that we see or seem is but a dream within a dream. – Edgar Allan Poe He has come such a long way, and his dream must have seemed so close that he could hardly fail to grasp it. But he did not know that it was already behind him. – The Great Gatsby","link":"/2016/08/04/Favorite-quotes-en/"},{"title":"触词生情的道听途说","text":"殷其雷，天阴霾；雨零耶，盼君留。殷其雷，从不零；卿若留，吾将从。 – 《言叶之庭》 我没有很刻意地去想念你，因为我知道遇到了就应该感恩，路过了就应该释怀。我只是在很多个小瞬间想起你。比如，一部电影，一首歌，一句歌词，一条马路和无数个闭上眼的瞬间。 – 佚名 以前我认为那句话很重要，因为我相信有些事说出来就是一生一世。现在想想，说不说也没有什么区别。有些事情是会变的，我一直以为自己赢了，直到有一天我看着镜子才知道我输了。在我最美好的时间里，我最喜欢的人不在我身边，如果能重新开始该有多好。– 《东邪西毒》 不管你曾经被伤害得有多深，总会有一个人的出现，让你原谅之前生活对你所有的刁难。 – 佚名 水果姐和格莱美，村上春树和诺贝尔，我和你。– 佚名 子乔醒悟的时候,美嘉却没有怀孕;一菲承认感情的时候,小贤却和诺澜在一起了;张伟爱情刚起步,却和对方成了对手。有些人就是这样,你准备好了,却已经错过了最好的时机在一起,我以为我必须变得足够好才有资格遇见你,殊不知,遇见你时我才是最好的我。 – 佚名 我想死，越发想死。一切已经无法挽回，无论做什么都以失败告终，平添一笔耻辱而已。 – 《人间失格》 慢慢明白了自己为什么不快乐，因为我们总是期待一个结果。看一本书期待它让我们变得深刻，发一条短信期待它被回复，对别人好期待被回报以好，写一个故事期待被关注。参加一个活动期待换来充实丰富的经历。这些预设的期待如果实现了便长舒一口气，如果没有实现就会自怨自艾。可是小时候也是同一个我，用一个下午的时间看蚂蚁搬家，小时候不期待结果，哭笑都不打折。– 《允许自己虚度时光》 你有一个正当的职业，租得起一间房间，容貌不差，懂得在上下班之余更进一步探索生命的意义，这都是很优美的事情，为何觉得自己卑微呢？你觉得卑微是因为没有用自己的主观眼在观看自己，而用了社会一般的功利主义的眼光，这是十分遗憾的。 – 佚名 风曾盈袖花满天，寂寞瑶琴拔离弦。剑光悄指凝眸处，不识情愁是红颜。三更流连酒千觞，绿腰舞罢共翩翩。霓裳如虹环佩裂，难解心头千千结。韶华易逝酒易尽，落叶依旧独徊旋。梦中轻拢又慢捻，不见珠泪落襟前。他朝两忘烟水里，冷月斜映入画帘。 – 《离弦》","link":"/2016/08/04/Favorite-quotes-cn/"},{"title":"健身党的必备英文手册","text":"在gym锻炼的时候，经常会和老外交流。刚开始的时候真的很懵，因为一些单词和用法在课堂上没有学过，考试更没有遇到过。所以在此整理一些健身房常用的，但是平时不太用的词汇。希望对大家有帮助。 基本词汇首先是一些健身党常用的词汇：增肌/减脂 bulk/cutting, 其中增加分为clean bulk和dirty bulk，后面这两个的含义应该比较明显。除了Strength力量训练以外，大家很常做的就是Cardio有氧了。在开始之前要热身warm up，结束之前最好拉伸stretch一下。在运动之后感觉肌肉充血叫flush而动作不标准导致借力就叫cheat。 下面根据各个部位的训练的动作，来介绍对应的英文。 Lower limb 下肢 Squat 深蹲；首先有Low bar 低杠和High bar 高杠位之分，其次根据下蹲程度，又分为：Deep squat 深蹲； Half squat 半蹲；Quarter squat 四分之一蹲（预蹲）；Lunge 箭步蹲；Pistol squat 单腿深蹲;Thruster 火箭蹲； Deadlift 硬拉；Romania deadlift (RDL)罗马尼亚硬拉; Sumo Deadlift 相扑硬拉；Stiff deadlift 直腿硬拉； Cleaning 抓举；Clean and jerk 挺举；这些我很少练习，不是很了解，但是有些老外特别热衷 还有一些常用锻炼下肢的器械：Leg press 蹬腿；Leg extension 腿部伸展； Upper limb/extremity 上肢 Raw 划船；很多动作分为Barbell 杠铃和Dumbbell 哑铃版本，比如Barbell raw 和 Dumbbell raw，后面再遇到类似的，就不再赘述了。Push up 俯卧撑；Dips 双杠臂屈伸；Lats pull 高位下拉；pull up 引体向上；还有Chain up对握引体向上和Chin up，特指下巴过杠的。 Bench press 卧推；还可以推广为Incline 上斜和decline 下斜卧推；Fly 飞鸟； Push press 实力举；Shoulder press肩推；Shrug 耸肩； Curl 弯举； 其他词汇 一些常用的装备：护腕：Wrist Warps；护膝：Knee wraps；助力带：Lifting Straps；健身球：Swiss ball；药球：Medical ball；负重腰带：dip belt；弹力带（短）：resistance bands；弹力带（长）：Pull up assistant band； 其他器械：龙门架：Cable Machine；深蹲架：Squat rack; 壶铃: Kettle bell; 曲杠: Ezor bar; 泡沫轴：Foam Roller；健腹轮：Ab Roller；跑步机：Treadmill；椭圆机：Elliptical; 划船机: Rowing machine; 登山机:Stair machine; 战绳: Battle rope; 跳绳：Skipping rope； 肌肉的名称：二头：Bicep；三头：Triceps；三角肌：Deltoid，分为Front 前束和 Rear 后束；胸肌：Pecs；斜方肌：Traps；背阔肌：Lats；背部下面统称：Low back；腹肌：Abs；臀大肌：Gluts；股四头肌：Quads；股二头肌：Hamstring； 补剂我用不多，听人说的也少，就知道一两个。乳清蛋白：Whey protein；氮泵：Preworkout；类固醇：steroids。","link":"/2016/08/04/Gym-English/"},{"title":"Renormalization group analysis of stability of band crossing in spin-1 spin-orbit coupled degenerate Fermi gas","text":"In one of my recent paper entitled Topological phases in spin-1 Fermi gases with two-dimensional spin-orbit coupling, we study the topological phases of Rashba spin-orbit (SO) coupled three-component Fermi gases. In fact, I also investigated the stability of the band crossings under repulsive $SU(3)$-invariant interactions, which is not included in the paper. In the following, I share my note on this matter. AbstractIn this note, I unitize mean-field theory (MFT), Renormalization Group (RG) and scaling to study the (in)stability of band touching points including Dirac point and quadratic band touching (QBT) in spin-1 degenerate Fermi gases with Rsahba-like SOC. Review of system HamiltonianThe single-particle Hamiltonian in k-space is$$ \\begin{pmatrix} \\delta_1-2t_s(\\cos k_x + \\cos k_y) &amp; t_{so}(-\\sin k_x + i\\sin k_y) &amp; 0 \\\\ -t_{so}(\\sin k_x + i\\sin k_y) &amp; 2t_s(\\cos k_x + \\cos k_y) &amp; t_{so}(-\\sin k_x + i\\sin k_y) \\\\ 0 &amp; -t_{so}(\\sin k_x + i\\sin k_y) &amp; \\delta_2-2t_s(\\cos k_x + \\cos k_y) \\end{pmatrix}. $$ If we only consider the touching points at $\\Gamma$ point, the effective single-particle Hamiltonian becomes$$\\begin{pmatrix} \\delta_1-(k_x^2+k_y^2) &amp; t_{so}(-k_x + ik_y) &amp; 0 \\\\ -t_{so}(k_x + ik_y) &amp; k_x^2+k_y^2 &amp; t_{so}(-k_x + ik_y) \\\\ 0 &amp; -t_{so}(k_x + ik_y) &amp; \\delta_2-(k_x^2+k_y^2) \\end{pmatrix},$$ where we also set $t_s=1$ (this does not affect the scaling since it can be treated as a mass term). For QBT, we require $\\delta_-=0$ and its low-energy Hamiltonian is$$H_0 = \\begin{pmatrix} 0 &amp; (-k_x + ik_y)^2 \\\\ (k_x + ik_y)^2 &amp; 0 \\end{pmatrix}.$$ For the Dirac point, we only consider the cases when it appears between the lower two bands and consequently, $\\delta_2=8$ is assumed (one may also set $\\delta_1=1$ and investigate the problem, but those two cases are essentially the same). Now, we have$$H_0 = \\begin{pmatrix} 0 &amp; -k_x + ik_y \\\\ -k_x - ik_y &amp; 0 \\end{pmatrix}$$ for the Dirac point. Scaling and numeric renormalizationBefore preceding, we first study the scaling of a massive (quadratic dispersion)and massless (linear dispersion) Fermion fields respectively. A massive scaler (spinless) Fermi field can be described by the following Lagrange $\\mathcal{L} = \\phi^\\dagger\\frac{\\partial\\phi}{\\partial\\tau}+\\frac{1}{2m}|\\nabla\\phi|^2 -\\mu|\\phi|^2-\\frac{u}{2}\\phi^\\dagger\\nabla\\phi^\\dagger\\phi\\nabla\\phi$. At quantum critical point $\\mu=0$ and $T=0$, such a a theory is invariant under scaling transformation $x’=xe^{-l}, \\tau’=\\tau e^{-zl}, \\phi’=\\phi e^{dl/2}$. We choose dynamic critical exponent $z=2$ and the mass $m$ is assumed to remain invariant under scaling. Then we also have dim$[\\mu]=2$ and dim$[u]=-d$. A similar argument for massless Dirac field $\\mathcal{L} = \\phi^\\dagger_R\\left(\\frac{\\partial}{\\partial\\tau} - iv_F\\nabla\\right)\\phi_R+\\phi^\\dagger_L\\left(\\frac{\\partial}{\\partial\\tau} + iv_F\\nabla\\right)\\phi_L$ would give $x’=xe^{-l}, \\tau’=\\tau e^{-zl}, \\phi_{R,L}’=\\phi_{R,L} e^{l/2}$. We also require $z=1$ and dim$[\\phi_{R,L}]=1/2$ holds for all dimension $d$. Now, we consider an uniform $SU(3)$ invariant two-body contact interaction$$V \\sum_{i,\\sigma\\neq\\sigma’} \\hat{n}_{\\sigma} \\hat{n}_{\\sigma’},$$then we have dim$[V]=2-d$ and dim$[V]=d-1$ for a massive band touching and Dirac point respectively. Given our case $d=2$, $V$ is marginal (massive spinless fermion) or relevant (Dirac fermion). Since the QBT is marginal, we calculate the RG beta function to one-loop order. Although it’s an effective two-level model, the third component is hardly mixed near the QBT. Giving the single particle Green function$$G_0 = \\begin{pmatrix} E-\\sigma_k &amp; \\eta_k \\\\ \\eta_k^* &amp; E+\\sigma_k \\\\ \\end{pmatrix} ^{-1},$$the one-loop correction counts two Feynman diagrams $(-1)\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2k}{(2\\pi)^2}G_{0,ab}G_{0,ba}+(-1)^2\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2k}{(2\\pi)^2}G_{0,aa}G_{0,bb} = \\int\\frac{d^2k}{(2\\pi)^2}\\frac{1}{2E_k}$, where $E_k=\\sqrt{|\\eta_k|^2+\\sigma_k^2}$ is the single-particle energy. Inserting back the effective Hamiltonian for QBT, we have $\\beta(V)=\\frac{dV}{dl}=\\frac{1}{4\\pi}V^2+O(V^3)$, where $l$ is momentum rescaling $k’=ke^{-l}$. Note that, this recovers exactly the QBT with $C_6$ symmetry and for $V&gt;0$, the effective coupling would flow to strong coupling. One may also verify that the beta function vanishes at second order for Dirac points but $V$ is always relevant at second order for even higher band touching points with order $n&gt;2$. Mean-field theoryFor the two-level model, we have the energy functional $E_{MFT}=\\int dx\\left(\\psi^\\dagger H_0\\psi+Vn_an_b\\right)$, where $\\psi$ is the spinor wave function and we use $a,b$ to denote each charged Fermion field. The energy functional can be rewritten as $E_{MFT}=\\int dx\\left(\\psi^\\dagger H_0\\psi - \\frac{V}{4}(n_a-n_b)^2\\right)$ to some constant with the particle number conservation assumption. Defining the order parameter $\\delta=\\langle \\frac{V}{2}(n_a-n_b)\\rangle$, and write the energy in terms of $\\delta$, we have $E_{MFT}=\\int dx\\left(\\psi^\\dagger H_0\\psi - 2\\delta(n_a-n_b)+\\frac{\\delta^2}{V}\\right)$. Now, redefine the single-particle Hamiltonian $H_0=H_0-2\\delta\\sigma_z$, we can solve the following self-consistent equation $ \\delta=\\frac{V}{2}\\int dE\\int\\frac{d^2k}{(2\\pi)^2}(G_{0,aa}(k)-G_{0,bb}(k))$, to obtain the order parameter, where $G_0$ is single-particle Green function. This can be easily solved and we obtain $\\delta=-\\frac{2\\pi}{V}+\\frac{V}{8\\pi}\\Lambda^2$ and $\\delta=\\frac{\\Lambda^2}{2}\\text{csch}(\\frac{4\\pi}{V})$ ($\\Lambda$ is energy cutoff) for Dirac point and QBT respectively. The result are plotted in the above figure and one can clearly observe that the Dirac point would achieve a finite mass term $-2\\delta$ for arbitrarily weak interaction, thus it is instable when $V&gt;0$. On the other hand, $\\delta$ exponentially approaches $0$ when $V&lt;\\sqrt{2\\pi}$ and is proportional to $V$ when $V\\gg\\sqrt{2\\pi}$. This indicates that the QBT is stable against a finite interaction strength and can only be broken with sufficiently large interaction. We also remark that the instability (stability) of Dirac point (QBT) is independent of energy cutoff. Self-energy correctionNow, we proceed to compute the self-energy correction using Hartree approximation $G^{-1}=G_0^{-1}+\\Sigma_H$. The one-loop correction is given by$$\\begin{align}\\Sigma_{H,ij}(k)&amp;=(-1)\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2p}{(2\\pi)^2}\\big(G_{0,ia}(k)G_{0,bb}(p)G_{0,aj}(k)+G_{0,ia}(k)G_{0,ab}(p)G_{0,bj}(k)\\\\ &amp;+G_{0,ib}(k)G_{0,ba}(p)G_{0,aj}(k)+G_{0,ib}(k)G_{0,aa}(p)G_{0,bj}(k)\\big)\\end{align},$$where $i,j=a,b$. Specifically, we have $$\\Sigma_{H,aa}=\\Sigma_{H,bb}=(-1)\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2p}{(2\\pi)^2}\\frac{E^3+E(\\eta_k^*\\eta_p+\\eta_k\\eta_p^*+\\vert\\eta_k\\vert^2)}{(E^2-\\vert\\eta_p\\vert^2)(E^2-\\vert\\eta_k\\vert^2)^2}=0,$$ and $$\\begin{align} \\Sigma_{H,ab}=\\Sigma_{H,ba}^* &amp;=\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2p}{(2\\pi)^2}\\frac{\\eta_k^2\\eta_p^*+E^2(2\\eta_k+\\eta_p)}{(E^2-\\vert\\eta_p\\vert^2)(E^2-\\vert\\eta_k\\vert^2)^2}\\\\ &amp;=(-1)\\int\\frac{d^2p}{(2\\pi)^2}\\left(\\frac{2\\vert\\eta_k\\vert+\\vert\\eta_p\\vert}{4\\vert\\eta_k\\vert^3\\vert\\eta_p\\vert(\\vert\\eta_k\\vert+\\vert\\eta_p\\vert)^2} \\eta_k^2\\eta_p^*-\\frac{1}{4\\vert\\eta_k\\vert(\\vert\\eta_k\\vert+\\vert\\eta_p\\vert)^2}(2\\eta_k+\\eta_p)\\right)\\\\ &amp;=\\int\\frac{d^2p}{(2\\pi)^2}\\frac{\\eta_k}{2\\vert\\eta_k\\vert(\\vert\\eta_k\\vert+\\vert\\eta_p\\vert)^2} \\end{align}.$$ There are two distinct two-loop corrections and we first consider the one without momentum transfer, which is to count one-loop correction for the $G_0(p)$ terms$$\\begin{align} \\Sigma_{H,aa} &amp;=\\Sigma_{H,bb}=(-1)\\frac{i}{2\\pi}\\int dE\\int\\frac{d^2p}{(2\\pi)}^2\\int\\frac{d^2q}{(2\\pi)^2}\\big(E^5+(E^3+E\\vert\\eta_k\\vert^2)(\\vert\\eta_p\\vert^2+\\frac{1}{2}Re(\\eta_q\\eta_p^*))\\\\ &amp;+E^3\\vert\\eta_k\\vert^2+\\frac{1}{2}Re(E^3(2\\eta_p+\\eta_q)\\eta_k^*+E\\eta_p^2\\eta_q^*\\eta_k^*)\\big)/\\left((E^2-\\vert\\eta_q\\vert^2)(E^2-\\vert\\eta_p\\vert^2)^2(E^2-\\vert\\eta_k\\vert^2)^2\\right) \\end{align}$$and it’s obviously trivial. AcknowledgementI thank Dr. T. Zeng from Westlake University for helpful discussions and conducting Exact Diagonalization (ED) numerics. The above results are consistent with ED. Reference J. Hou, H. Hu, C. Zhang, Topological phases in spin-1 Fermi gases with two-dimensional spin-orbit coupling, arXiv 1809.04537. S. Sachdev, Quantum Phase Transition, Cambridge University Press, Cambridge, UK (1999). K. Sun, H. Yao, E. Fradkin, and S. A. Kivelson, Topological Insulators and Nematic Phases from Spontaneous Symmetry Breaking in 2D Fermi Systems with a Quadratic Band Crossing, Phys. Rev. Lett 103, 046811 (2009).","link":"/2018/09/12/RG-Stability-Spin-1-SOC/"},{"title":"随机漫步的傻瓜(Fooled by Randomness)","text":"书名：随机漫步的傻瓜 (Fooled by Randomness)作者：纳西姆·塔勒布（Nassim Taleb）评分：3.5/5.0推荐：整体比较一般，不是很推荐。书荒时可以一读。 这其实是今年读第二本书，第一本书是《你学的数学可能是假的》。因为当时还没有打算做这个系列的notes，所以没有留下什么有用的笔记，就简单的留个书评吧。 书名：你学的数学可能是假的 (Je mehr Löcher, desto weniger Käse)作者：霍格尔·丹贝克（Holger Dambeck）评分：3.0/5.0推荐：不推荐。可能是我的预期太高，导致读书的时候有了极大的落差。我对作者并不了解，但据说是一名数学大牛。但是显然大牛写这本书的时候定位太低了。整本书内容过于简单，叙述也很平庸。读完没有一点学习到新知识的兴奋感。因此并不是很推荐有高中以上数学背景的人读。但这倒是让我想起了《什么是数学》这本书。日后有机会应该重读一遍，顺便做一个详实的笔记。 回到《随机》这本书，其实准备这个博客的时候，这本书也已经读了80%。也只能凭印象稍稍写点东西了（Flag：下一本书是《缺爱》，会开始写比较详细的笔记）。其实早在16年就读过同一个作者的《黑天鹅》。虽然这两本书宣称是《随机》是《黑天鹅》的前置本，更容易理解。但其实读起来并没有必要真的按这个顺序。整本书读下来的感觉就是作者太卖力sell他关于随机性的观点了。我并不否认作者许多关于随机性的观点，事实上，我最早开始读这个系列，正是由于我比较相信这样一个观点：对于人生这样一个复杂的非线性不可积系统而言，初始条件和随机扰动的影响可能是巨大的。然而，作者太专注于向读者推销这个观念，用力过猛，导致很多例子事实上经不住推敲。更有很多从其他领域引用的例子不是很妥当。其次，作者经常说一些看似有理，但却毫无逻辑的话。比如，在第十三章，作者为了阐述因为市场没有明确规则，所以想用一个具体的算法来计算市场未来的不确定是不可能的这样一个观点时，说“大部分科学家都很固执，否则就不可能有足够的耐性和精力去执行那么艰巨的任务，例如一天花18小时去让他们的博士论文更完美”， “提出博士论文的人，必须为它‘辩护’；主式者列举令人信服的论点证明论文观点不正确时，我们极少见到学生改变心意”。作者在文中大谈样本与随机性导致的偏差的重要性，然而到论证自己观点的时候却随随便便给出一个如此主观的论证。作者也非教育从事人员，能观察到的“学生样本”又有多少？足够排除随机性导致的偏差么？更不用提地域性和时代导致的样本偏差。这样的论点全书比比皆是，就不一一列举了。在本书开篇，当作者提出市场是一个随机性过大的动力学系统的时候，我是如此的兴奋。因为我非常赞同这样的观点，任何一个deterministic的动力学系统，一旦随机涨落达到一定程度，我们根本无法预测其在某一个history的具体演化（当然，通过考虑足够多的演化路径，我们可以得到一些统计显著的结果，但这是另一个故事了）。然而作者的论述方式却让我大失所望。 当然，，这本书亦是有可取之处的。不考虑论证的不严谨性，其中一些例子还是非常有意思的。尤其一些例子虽然简单，但确实是我从来没有想到过的。 其中一个例子描述了一个非常简单的骗局。当然，在现实生活中，这个骗局实施起来会非常困难，但是这个例子很好地反映了作者对市场和随机性的一些思考。假设我是一个有一些闲钱（可以用于投资）的普通人。一天，我收到了一封信件，里面告诉我接下来一个月某样投资产品（某支股票，某些期货，甚至房地产）会增值。我的第一反应当然是不屑一顾，并且可能置之不理。但是，我下个月，下下个月都收到了同样的邮件，并且我发现这个邮件中的预测都是正确的！当然，我也明白连续三个月预测正确并不能说明什么，也可能是运气使然，于是我决定再等半年，如果接下来这半年时候TA都能预测准确，我就计划投资。到这里，你也应该能猜出来故事的发展了。接下来6个月，我收到的预测完全正确。于是，我把我的资产全部投资了，最后血本无归。 那么，这个骗局是如何实施的呢？事实上，实施这个骗局的人对金融市场一无所知！他们的做法如下。首先，他们从全国筛选出一些人（比方说16384），并买到他们的地址等信息。接下来，他们给这些人中的一半发邮件，告诉他们市场将走高；而对于另一半，则发邮件说市场将走低。如此一来，不管下个月发生什么，都会有一半的客户，亦即8192人认为他们收到了正确的预测。接着，这些骗子只需要重复同样的事情，9个月之后，还有32个人收到了完全正确的预测，因为把这群骗子奉为金融大神，将自己的资产拱手相让。而“我”正是这32个幸运儿之一。 还有一个关于概率计算的例子也很有意思。其实，这个例子在本科上《概率论与数理统计》时，已经讲过。当时听到就觉得非常有意思，当时自己也确实从未想过类似的问题。所以这里简单叙述一下。假设有这样一个检测某种疾病的手段，误判的概率只有5%。这种疾病在人群中的发病率为千分之一，那么当你的诊断结果为阳性时，你患病的概率是多少？一个想当然的答案是95%，因为有5%的概率是误判。但事实上并非如此。因为这种病发病率只有千分之一，也就是说1000人中平均只有一人患病，那么剩下999人中，会有大约50人被误诊为阳性，那么被诊断阳性的人患病几率应该是1/51~2%。 最后，作者在文中的一个观点我是比较认同的：概率与统计是反直觉的。所以学好概率与统计，并不代表你可以日常生活中应用这种思维。这应该是我们牢记的一件事情。","link":"/2020/01/10/Fooled-by-Randomness/"},{"title":"82年生的金智英(Kim Ji-young, Born 1982)","text":"书名：82年生的金智英(Kim Ji-young, Born 1982)作者：赵南柱(Cho Nam-ju)评分：5.0/5.0推荐：强力推荐的一本书。作者用平静细腻的语言道出了受压抑女性的辛酸苦楚，这种落差感反而更加强化了作者的观点。作者从生活入手，把女性一生可能遭遇到的许多不公平一一叙述。对人物心理动作和环境的细致刻画让读者感同身受，简短却丰富的语言发人深省。 前一段时间，听说了这本书被改编成电影，并且非常火爆。本身我对这类题材并不是很感冒，但是碰巧朋友圈中有一个朝鲜族的女生，经常听她说起朝鲜族对女性的压抑。所以便打算通读一下原著。 2015年-秋本书一开篇，便切入正题：金智英会常常进入别人视角，比如自己的母亲，过世的学姐，同自己的丈夫郑代贤对话。甚至还知道一些只有当事人知道的往事，而在事情发生之后自己却毫无印象。最终纸包不住火，在一次中秋家庭聚会上，“变身”成自己的母亲，开启了吐槽模式：“只有你们家人团聚很重要吗？我们也是除了过节以外，没有别的机会可以聚在一起好好看看三个孩子”，让全家人目瞪口呆。在这里，作者对于很多细节的描写很到位，比如郑代贤的内心活动以及金智英在准备中秋聚餐时大量的家务劳动，处处也暗示着金智英在男方大家庭中受到的不公正待遇。 1982年~1994年这里作者回到了金智英的童年，而开篇就指出来“好像男孩优先于女孩是理所当然之事……”。在童年时期，金智英就受到了非常不公平的待遇，家里的任何资源都优先给年幼的弟弟。但从作者的叙述中可以感受到，作者认为这不是最可怕的，最可怕的是，年幼的金智英从出生就看到弟弟的“特殊待遇”，所以并不觉得这样是不对的。作者随即又谈到了金智英的奶奶。奶奶一个人支撑着整个家庭，却对养尊处优的爷爷没有任何怨言。到老了，明明收到媳妇的照顾，却只夸张自己的儿子，又“发自内心地为媳妇着想”：要生个儿子。而在当时的韩国，因为政府实施节育政策，只要是确定怀的是女婴，就足以构成“医学上的理由”，将孩子打掉。 在随后的文字中，作者通过描述金智英父母的生活来反映两性的不平等，这种不平带穿插再三代人之间。奶奶从“受害人”变成了“助虐者”；母亲默默地付出，承受着一切，为所谓的“家人”放弃自己的人生和理想；而金智英姐妹也被教导去习惯这种不对等的待遇，但是她们在学校中已经学会批判性思考并且开始行动和反抗。母亲也在一直默默地帮助金智英姐妹。 1995年~2000年时间来到的金智英初中时期，大量的女校开始变为男女合校，因为过去十几年内，男婴出生率远远大于女婴。同时，对女生着装定了十分严苛的规定，而对男生的衣着却没什么要求。而这些规定在女同学们身体力行地抗一下，渐渐被放松。接着，作者又叙述了一个“大姐头”带领同学对抗暴露狂地故事。既点题了女生在学校受到地不公平待遇，又暗指了思想地萌芽。最后，作者以金智英初潮地一段故事结束了初中生活。 到了高中，作者上来就指出了“性骚扰”这个尖锐地问题，还讲述了一段金智英被男同学跟踪骚扰地故事。然而，在这些事件中，犯罪者往往没有受到应有的惩罚，而受害人却总受到批评和二次伤害。事实上，这样的事情直到今天还屡见不鲜。 从另一方面，随着女性权益在2000年左右得到社会的广泛认可，金智英姐妹有机会，也有胆识去挑战家庭和社会对女性的刻板的印象。姐姐最终“听取”了母亲的建议就读了师范学校而金智英则自己选择去了首尔的一所大学。 2001年~2011年在金智英进入大学之后，随着父亲投资的成功，一家人的生活变得更好了。这里穿插了许多故事：金智英和男友的平等恋爱，登山社十年之后才有了女性社长，金智英在分手后被其他男生说成是“被嚼过的口香糖”，女性在职场上的艰辛等等。虽然女性的权益在渐渐地得以保障，但根深蒂固地偏见还需要时间来抹平。 2012年~2015年这次作者从金智英和其丈夫见父母切入，过渡到他们的婚姻生活，然后谈到了所谓“户主制度”。在户主制下，子女必须随父亲姓且终生不得改姓。令我惊讶的是，韩国直到2008年才废止了户主制。但事实上，随母亲姓的例子屈指可数。随后，作者着重描写了金智英在生育方面以及生育后照顾孩子时受到的来自家庭、同事、社会等等的压力。 2016年此时作者以金智英心理医生的身份说明了金智英的病是由于产后抑郁延伸到育儿抑郁而导致的。作者也说明了，自己直到通过和金智英细致入微的交流，才明白了女性背后不为人知的辛酸，才明白了自己妻子对家庭的付出。最后，作者还提到了一个即将生产的同事，虽然专业水平很高，但也即将离职——为了家庭孩子放弃自己的生活。 最后，作者也留了一个悬念“金智英会康复么”？其实，从我的角度看来，金智英是否康复真的重要吗？她的康复又能改变什么呢？事实上，不仅仅是女性受到压抑这一方面，这个社会有各种毒瘤的存在，它们通过漫长的历史河流浸润在每一个人的内心，一个人的康复与觉醒根本改变不了什么。很多人相信历史的车轮是前进的，所以人类社会就是前进的。或许在足够大的时间尺度上可以这样说，但是从微观尺度上就未必如此了。就好比这一点：金智英真的有比自己母亲过的更好吗？我认为在类似两性不平等这样的问题，最大的障碍就是“每个人只能看到自己的痛苦”，只有通过阅读、倾听，我们才能对世界的另一面有所了解。金智英的悲剧已经发生，但是我们还可以现在做出改变，让悲剧不在郑媛芝身上重演。","link":"/2020/03/21/Kim-Ji-Young-Born-1982/"},{"title":"缺爱(Exister：Le plus intime et fragile des sentiments)","text":"书名：缺爱 (Exister：Le plus intime et fragile des sentiments)作者：罗伯特·纳伯格（Robert Buettner）评分：1.0/5.0推荐：完全不推荐。虽然我在开始阅读这本书的时候，感觉还不错，但是随着内容的深入，很快有了嚼蜡之感。作者的核心思想很好，可是深度不够，很多地方只是泛泛而谈，也有不少地方很罗嗦。作者试图把存在感地理论说的大而全，可以涵盖一切，但是却又无力做到这个宏大的目标。通篇读下来，你会感觉作者只是单纯地在表达自己地想法，引用一些个例和无来源的数据来支持自己地观点。但是却从未把自己地观点和他人作比较。 在具体说这本书之前，先谈一下中译名。“缺爱”这个译名确实太具有误导性了。这本书的主题是“存在”。当然，按照作者的观点，“爱”对于个人的存在感来说是非常重要的，但暴力地把其等价为“缺爱”看我看来还是不妥。原书是法语，标题叫“Exister：Le plus intime et fragile des sentiments”，我觉得作者想传达的关键翻译成英文应该是“Existence: The most intimate and fragile sentiments”。我认为作者的核心在于论证“存在感”(existence)和“物理存在”(being)并不是等价的，正如作者所引的这样一句话： 赋予人们生命并不足以让他们生存。 –勒内 拉福格（René Laforgue） 我觉得这里“生存”可能翻译并不准确，作者想传达的意思更多的应该是“赋予生命不能让你感觉到自己生命的存在”。这里再插一句，我还想吐槽一下国内的营销。这本书看起来在美国不是很火，美亚上都找不到英文版。搜到的法语版更是无人问津。不过无论如何，这本书还是值得一读的。 首先，我对本书的好感来源之一是比较带有偏见的。作者大量引用了卢梭的文字 我不时念及世间万事的变化无常， 就像这湖面展现出来的影像， 但这种想法不但模糊淡薄， 而且倏忽即逝； 这些微弱的印象， 很快消逝在轻轻抚慰着我的湖面均匀的波浪中。 – 《一个孤独漫步者的遐想》 卢梭 夜幕降临时分，我从小岛的高处走下来，悠然自得地坐到湖边沙岸一个隐蔽处；波涛声和水面的涟漪吸引了我所有的感官，驱走了我灵魂所有的纷乱，使我的心沉浸在甘美的遐想之中，黑夜就这样在不知不觉中垂降了。波澜起伏的湖水，一波又一波的涛声，不断震撼我的双耳和两眼，跟我的遐想在努力平息的澎湃心潮相互应答，使我无比欢欣地感到自我的存在，而无须费神去多加思索。我不时念及世间万事的变化无常，就像这湖面展现出来的影像，但这种想法不但模糊淡薄，而且倏忽即逝；这些微弱的印象很快消逝在轻轻抚慰着我的湖面均匀的波浪中。 – 《一个孤独漫步者的遐想》卢梭 我对启蒙时代百科全书派的人士很有好感，其中卢梭尤甚。后面有机会也会重读一些他的作品（又一个Flag- -）。不得不说，本书作者的论点是非常“存在主义”的。比如，本书的核心之一可以概括为 当一个人拥有存在感时，生命的意义自然会显现。不是意义赋予存在感，而是感觉到存在这一事实让人觉得存在是有意义的。 存在主义也起源于法国，其核心价值观之一就是“生命的意义是无法通过理性思辨而发现的”。所以作者在这里首先就说明了，生命的意义是一种结果。我们并非为了探索生命的意义而存在，而是我们找寻到了存在，生命的意义就会自然的浮现。作者的观点是存在感的来源就是我们与他人和社会的关系，所以作者接下来进一步探讨了“人际关系”和“归属关系”。 关系人际关系作者认为“某种程度上，人际关系就像证券投资，如果我们不投入，不去爱，便不可能赢；如果投入了，倾注了感情，却有可能输。 从这种意义上来说，所有的关系都是一种异化，但却是一种必要的、必不可少的异化。” 作者还将人际关系分为以下四个基本类： 哺乳关系 （不对等关系） 顾名思义，这是哺乳者和婴儿之间的关系。可以与权威关系重叠，如单亲家庭。 权威关系（不对等关系） 在家庭中，具有权威一方和孩子的关系。可以与哺乳关系重叠，如单亲家庭。 兄弟关系或平均主义关系（对等关系） “兄弟”不仅仅局限于家庭内部的兄弟，也可以延申到同龄人。兄弟关系可能导致竞争。 恋爱关系 （对等关系） “爱的本质是希望被爱”。–Jacques Lacan 并且认为对不同关系的倾向会影响我们的行为决策。同时，两人之间的关系是会随着时间，场景的变化而流动。 归属关系作者同样将归属关系划分成四类： 家族归属关系 家族在文化，精神，基因上具有连续性。一个新生儿的第一个身份就是来自家族的认可。 兄弟归属关系 这里兄弟并非来自家族，而是家族之外的同龄人。这对于个人的学习和成长至关重要。随着一个人投入到不同的兄弟归属关系中，ta将展示出自己不同的面貌。 夫妻归属关系 安全感和性别认同感的重要来源。如今的夫妻关系已经不再是为了追求物质保障。 意识形态归属关系 意识形态群里往往需要个人放弃一些自主性。 作者强调了一点关于工作关系。工作关系非常重要，但是之所以没有分为一类，是因为不同的人对工作关系的理解偏差较大，但其往往可以放入前面的分类之中。过度的群体关系反而对存在感有害，就如《乌合之众》里面的论点。 存在作者在本章开篇就指出一个悖论：我们既渴望独立自由，又渴望建立关系，获得认可。我对这个观点倒也赞同，但是作者一边支持这个观点，一边说“一个人的依附关系越多，就越自由”。这一点倒是让我觉得自相矛盾。作者随后重点阐述了个体自尊和群体自尊，以及它们的相互竞争。我并没有读到什么出彩之处，所以也不做过多的评论了。 存在感的丧失作者认为存在感是脆弱的，且关系的破裂会造成存在感的丧失。作者将其分为了两种情况。 在出生时就没有获得认同的人：作者认为这类人终其一生都在寻找类似的认可来补偿这种缺失，然而他们自己也明白：这种缺失是无法弥补的。 突发事件导致我们已经构建好的存在感岌岌可危：失恋，离别和丧葬都是很好的例子。作者进一步把这些事件推广，比如：不被配偶家庭接受，失去工作，遭遇拒绝等等。种族主义者，性别歧视者可以通过人身攻击来瓦解他人的存在感。 那么，当自身存在感丧失的时候，我们需要积极地修补。正面的做法包括修复关系，重新融入某个集体。但是，作者提到，还有一种逆反的方式，即否定自己的存在感受到打击。但是作者认为这类行为往往无法真正的解决问题。这种临时获得的存在感只是空中楼阁。作者也着重讨论了两点： 遗世独立：有一类人，他们通过故意表现的与他人不一样是因为他们内心渴望获得尊重，渴望一种高高在上的感觉。但是这样的举动往往会使得他们远离人群，更加削弱他们的存在感。关于这一点，我觉得作者的论述不是很到位。比如说，宗教狂热份子。按照作者的说法， 这类人的存在感是很弱的。但是这类人因为狂热的信仰，他的存在感完全是建立在同一个教会里其他人的认可之上。这是，来自社会其他成员，乃至于其家庭成员的认可可能都不是很重要。这种把自己存在感完全建立在某一个人（或群体）之上的极端行为，或者可以解释很多狂热分子的犯罪以及恐怖主义行径。 不文明行为：这一类其实和上面多多少少有点类似。即通过不文明行为来“异化”自己。作者认为这本质是一种逃避行为，并把孩子的“人来疯”归类为此类行为。 崇高与绝望 崇高：通过艺术创作并通过作品为自己赋予存在感，作者认为这本质是一种逃避现实痛苦的方式。 绝望：崇高的阴暗面，会导致破坏、暴力、毁灭、虐待等一些疯狂地寻找存在感的方式。 实现自我实现？作者认为人仅仅依靠自己是无法做到自我实现的，因此有些人寻求一些更危险的行为：吸毒，酗酒，自残，赌博，做第三者等。 抑郁作者认为抑郁是一种无力的愤怒，来源自绝望感，变现为感觉不到存在的目的。 重回人世关于抑郁的治疗，作者提出了三个比较重要的点： 引导病人发泄情绪而不是强迫他们表现出积极的情绪。 更多的关注心理层面而不是生理层面；作者认为抑郁是存在感的问题。 去标签化；不要强化“病人”与“正常人”的区别。","link":"/2020/02/10/Exister-Le-plus-intime-et-fragile-des-sentiments/"},{"title":"AlphaZero explores global optimization of quantum dynamics in superconducting circuit QED","text":"I’ve been thinking about a class of optimization problems on a quantum computer and wish to explore them with machine learning algorithms, especially reinforcement learning, as it does not require a good initial guess (radom, intuition or whatever). More recently, I came across to the paper “Global optimization of quantum dynamics with AlphaZero deep exploration”, which has been published online about 2 weeks ago. While the authors considered a rather ideal situation, their work did shed lights on my research. So, I prepare this note to briefly discuss their work and some relevant topics. BackgroundQuantum control is basically to design a series of control signals, which transfer a quantum system from an initial state $\\left|i\\right\\rangle$ to a given final state $\\left|f\\right\\rangle$. If you ever learned a little bit quantum mechanics, you would probably know the adiabatic theorem and may think less of quantum control theory. However, adiabatic process is not realistic in experiments and real-life applications due to underlying constraints (e.g. unreachable parameter space, limited control time). Not to mention that there’s no adiabatic limit in Anderson/many-body localized or Floquet (periodically driven) systems. Quantum optimal control theory has raised for designing control signals of stimulated system. Under ideal physical conditions, it has been shown that local exploitation is sufficient for ultimate optimization. This is a result of “perfect” landscape of the transition probability $P_{i\\to f}=\\vert\\langle i\\vert U(C(t))\\vert f\\rangle\\vert^2$, where $U(C(t))$ is the unitary transformation determined by the control signal $C(t)$. Previous works have proven that when the quantum state of interest is finite, the functional $\\delta P_{i\\to f}/\\delta C(t)=0$ has at least one solution so that $P_{i\\to g}=1$. Then, there is no suboptimal local extrema as long as there’s no extra constraint. As discussed before, this is not realistic and in fact, imposing significant constraints on the dynamics may make the optimization problem as hard as “NP-complete” problems (I’m not 100% certain about this). Besides the optimal control methods, reinforcement learning with deep neural network (DNN) has been applied to optimize dynamically evolving systems. More recently, the AlphaZero algorithms have shown great breakthrough in playing games like Go and Starcraft. AlphaZero combines Monte Carlo tree search (MCTS) with a one-step lookahead DNN, leading to more focused and heuristic-independent explorations. AlphaZero explores optimization of quantum dynamicsPhysical modelThe authors consider a two-transmon system with cross-resonance gate, whose dynamics is govern by the Hamiltonian $H=\\Delta b_1^\\dagger b_1+J(b_1^\\dagger b_2+ h.c.) + \\Omega(t)(b_1^\\dagger+b_1)$, where $\\Delta/2\\pi=0.35$ GHz is detuning, $J/2\\pi=5$ MHz is qubit coupling constant and $\\Omega(t)$ denotes the control field. The $b_i,i=1,2$ is the qubit-lowering operator. I also write here, the corresponding matrix form in computational basis for convenience$$H = \\begin{pmatrix} 0 &amp; 0 &amp; 0 &amp; \\Omega(t) \\\\ 0 &amp; 0 &amp; J &amp; 0 \\\\ 0 &amp; J &amp; \\Delta &amp; 0 \\\\ \\Omega(t) &amp; 0 &amp; 0 &amp; \\Delta \\end{pmatrix}.$$ The criteria/rewards function here is clearly the fidelity, defined as $\\vert\\frac{1}{\\text{dim}}\\text{Tr}\\left[U^\\dagger(t)U_f\\right]\\vert^2$, where $U_f$ is the target unitary. In this work, the authors consider an entangling gate$$U_f=\\sqrt{\\sigma_z\\sigma_x}=e^{(-i\\frac{\\pi}{4}\\sigma_x\\sigma_z)} = \\begin{pmatrix} 1 &amp; -i &amp; 0 &amp; 0 \\\\ -i &amp; 1 &amp; 0 &amp; 0 \\\\ 0 &amp; 0 &amp; 1 &amp; i \\\\ 0 &amp; 0 &amp; i &amp; 1 \\end{pmatrix}.$$Note that, once a particular $\\Omega(t)$ is given, the corresponding unitary can be solved by simulating quantum time evolution. The AlphaZero implementationWe refer to a successful generation of a pulse sequence as an episode and the agent wants to maximize the fidelity at the end of each episode. Again, the AlphaZero algorithm can be considered as a MCTS, guided by a one-step lookahead NN. We discuss each part in the following. Monte Carlo tree searchIf you are not familiar with MCTS, please refer to Wiki - MCTS for a basic introduction. Once we discretize the time, we may treat the signal as a time series. Such a sequence represents a state $s_i$ at time $t_i,i=0,1,2,…,N$. To implement the MCTS, we take a possible state as node and parent/child nodes are connected by edges, which contain important information including a visit count $N(s_i,a_i)$, a total action value $W(s_i,a_i)$, a mean action value $Q(s_i,a_i)$ and a prior probability $P(s_i,a_i)$. Initially, the tree has only a root with the state being identity matrix at $t_0$ (nothing has been done on the system at $t_0$). The probabilities $P(s_t,a_t)$ are initialized with the NN outputs while others are set as zero $N(s_t,a_t)=W(s_t,a_t)=Q(s_t,a_t)=0$. At the expansion stage, the authors introduce an uncertainty $U(s_c,a_j)=c_pP(s_c,a_j)\\frac{\\sqrt{\\sum_iN(s_0,a_i)}}{1+N(s_c,a_j)}$ to help them select the action under current state $s_c$. Specifically, the next action is given by max$({Q(s_c,a_j)+U(s_c,a_j)})$. Note that, $c_p$ determines the level of exploration in the sense that the algorithm tends to take less visited action with larger $c_p$. $c_p=1$ is set in this work. Now, the expansion is repeated until we encounter a new leaf node. Once we arrive at a new leaf $s_n$, we feed the current unitary into NN to get outputs $(p, v)$. We initialize all the edges of this leaf as before, namely, $P(s_n,a_t)=p$ ($p$ is generally a vector) and $N(s_n,a_t)=W(s_n,a_t)=Q(s_n,a_t)=0$. After this is done, we have to do back-prorogations for all the parent state $s_r$ involved, following $N(s_r,a_r)++$, $W(s_r,a_r)+=v$ and $Q(s_r,a_r)=W(s_r,a)/N(s_r,a_r)$. Once a pre-set number of searches is reached, we generate a policy for current root $s_t$ using the visit count $\\pi(a_j\\vert s_t)=\\frac{N(s_t,a_j)^{(1/\\tau)}}{\\sum_iN(s_t,a_i)^{1/\\tau}}$, where $\\tau$ is also a hyperparameter that governs the level of exploration. In their work, the authors hyperbolically anneal it from 1 to 0.001 with a rate of 0.001. The authors also take a deterministic policy by choosing the maximum when $\\tau&lt;0.9$. Once an action is drawn by the policy, the root $s_t$ is cached and one of its child state (namely, the chosen one) becomes the new root and all other children are discarded or dumped. The above procedure is repeated until we have a new full control sequence in the cache and then, one episode is done. In their implementations, the authors cut the branches, which have been fully explored in previous episodes, to improve efficiency. Neural networkThe NN takes the unitary $U(t)$ as input and outputs the possibilities $p$ for each possible movement and an estimate of final fidelity $v$. The NN is initialized randomly and is only trained after one episode is completed. In this work, the authors choose a simple feed forward network, in which there are 4 hidden layers, each containing 400 nodes, followed by batch normalization and a rectified linear unit. The L2 regularization parameter is 0.001 and they apply Dirichlet noise to the probability $P(s,a)=(1-\\epsilon)p_a + \\epsilon \\eta_a$, where $\\eta\\sim\\text{Dir}(0.03)$ and $\\epsilon=0.25$. ResultsThe results can be easily understood through Figs. 2-4 in the paper and AlphaZero indeed showcases great performances. Here, I only remarked some important aspects of two studied cases. Digital gate sequencesIn this case, the control signal is simply Gaussian pulse $\\Omega(t)=\\frac{a}{\\sqrt{2\\pi}\\tau}e^{-\\frac{(t-\\Delta t/2)^2}{2\\tau^2}}$, where $\\tau=0.25$ ps, $\\Delta t=2.0$ ps and $a=2\\pi/1000$. The pulse series can be represented by a string of 0 and 1. The gate duration is typically around 50 ns, which contains $10^4$ to $10^5$ signals. Constrained analogy pulsesAnalogy pulse is a little bit tricky. The authors sample the amplitude of the beam by 60 points and consider the bandwidth constraint via a convolution with a Gaussian filter function $\\Omega’(t)=\\int e^{\\frac{(t-t’)^2}{\\sigma^2}}\\Omega(t’)dt’$. The maximum amplitude is chosen as $\\Omega/2\\pi=1.0$ GHz and $\\sigma=0.7$ ns. Reference Global optimization of quantum dynamics with AlphaZero deep exploration Quantum optimally controlled transition landscapes Reinforcement Learning in Different Phases of Quantum Control Reference - AlphaZero Mastering the game of Go with deep neural networks and tree search Mastering the game of Go without human knowledge A general reinforcement learning algorithm that masters chess, shogi, and Go through self-play","link":"/2020/02/03/Global-optimization-of-quantum-dynamics-AlphaZero/"},{"title":"富爸爸 穷爸爸(Rich Dad Poor Dad)","text":"书名：富爸爸 穷爸爸(Rich Dad Poor Dad)作者：Robert Kiyosaki and Sharon Lechter评分：4.5/5.0推荐：比较推荐。作为一个受到传统“穷爸爸”教育的孩子，这本书带来的关于金钱和财商的观念无疑是颠覆性的。推荐跟我一样的理财小白作为入门书籍认真一读。 虽然我一直对金融经济很感兴趣，但是只是读过一些比较经典的书比如《国富论》以及曼昆的《宏观经济学》和《微观经济学》。最近因为即将开始实习工作，决定真正了解一下金融市场以及一些理财理念。似乎这本书在国内曾经享誉一时，所以打算拿来读一读。 整本书读下来感觉还是收益不少，虽然本书并没有讲太多的大道理，也没有列出一些实际可行的投资操作，但是其中的观念还是很发人深省的，也改变了我对于财经管理等学科的看法。打算后面再跟进一些类似的书籍。 序言本书首先描述了大多数普通家庭的“困境”：每一代人通过努力学习，找到一份稳定的工作后拼命工作。但是因为缺乏财务管理的知识，他们努力赚来的钱根本不够支付政府税收，养老保险，个人消费以及教育支出等等，这就导致了他们需要更努力的工作，并教导自己的孩子努力学习，以便找到更好的工作。但是他们的孩子往往也会重复自己的老路。 工作是不稳定的：一家上市公司宣布裁员通常会导致股价上涨，因为这个消息说明公司通过引入自动化或者人力资源整合降低了人工成本。 让自己变成聪明人，从而可以为更好的企业工作。 拥有自己的企业，从而可以雇佣聪明人为自己工作。 不为钱工作作者首先通过一个故事说明了：要积极地思考如何赚钱，付诸行动并且不要放弃。在这个故事中，作者也反复暗示了：避免陷入消费陷阱。 作者又用叙事的方式引出了一个观点：穷人和中产阶级为钱而工作。作者认为，大多数人想要找一份稳定的工作是出于恐惧（失业，欠债，经济损失等等），从而成为工作的奴隶，把怒气发在管理者身上。赚钱并不是解决财务状况的方法，学习金融财务知识才是解决问题的关键。 作者在论述消费陷阱的时候举了一个例子： 大多数人一生都在追求工资、加薪和职业保障，从来不问这种感情支配思想的生活之路将通向哪里。就像一幅画表现的：驴子拉车，因为主人在它面前挂了个胡萝卜。主人清楚自己想要去哪里，而驴子却只是在追逐一个幻影。但第二天驴子依旧会去拉车，因为又有胡萝卜放在它的面前。 这个例子在我看来并不是特别的贴切，但却也抓住了消费陷阱的核心。作者反复强调，因为人对于金钱很敏感，所以更要理性行事。尤其是现代社会不再实行“金本位”，钱变得更加“不真实”。 为什么要教授财务知识作者在这一章节首先强调对了基本会计学理解的需求，并以损益表（Income statement）和资产负债表（Balance sheet）为例切入。 抛去教科书上复杂的定义，作者用十岁儿童都可以明白的话说明了： 资产是能把钱放进你口袋里的东西；负债是把钱从你口袋里取走的东西。 道理确实很简单，我只要一直购入资产就可以了，但是实际上却很少有人做到。一是大多数的收入源自工资，并且在获得收入后大量支出消费，并购买负债（信用卡、贷款）。二是缺乏渠道购买好的资产或是缺少原始资本购买资产。那么这时候要做的就是，变卖负债，减少支出，学习财务知识，敢于“冒险”。作者随后花了大量的篇幅试图说明自住房屋本身是一种负债，而不是资产。但是这并不意味着我们就不能买房，二是要在买房前购置资产，保证现金流的平衡。作者简单地总结了一下： 富人买入资产；穷人只有支出；而中产阶级则买入自以为是资产地负债。 大多数人都在为别人工作：为老板工作（创造收入），为政府工作（税收），为银行工作（贷款、信用卡消费）。 关注自己的事业作者首先通过麦当劳创始人的一个故事引出一个观点：事业不等于工作。每个人除了专业工作之外，还应该有自己的事业，事业的重心是资产项目。作者还列举了一些可以被视为资产的项目：股票，债券，基金，能产生收入的房地产，票据，版税权等等。 税收的历史和公司的力量本章开始作者就指出：事实上富人并未被征税，是中产阶级尤其是受过良好教育的高收入的中产阶级在为穷人支付税金。这一点在美国是很正确的，一般来说，passive income的税率要比W2低很多。作者认为公司是部分人降低税务的工具，并强烈建议个人拥有一个由资产组成的公司作为合理财务策略的一部分。 财商（理财智商）由4个方面的知识构成： 会计：亦即财务知识。我们需要这些知识来阅读报表和判断某一项投资的优劣。 投资：投资的策略和方案。Be creative。 市场：要了解市场供求关系。 法律：合理利用减税政策和企业支出；在诉讼中保护自己，用信托隐藏财富。 富人的投资在这一章节中，作者利用自己的一些经历来强调了“果敢”和“创造性”的重要性。 目前投资主要分为两种，第一种是通过中介机构进行“一揽子”投资，而第二种则是自己创造投资机会。作者更倾向于第二种，但是也强调了这需要一些额外的技能： 寻找他人忽略的机会。 增加资金的渠道。 把精明的人组织起来。 学会不为钱工作作者在这一章节强调了一点：光有一项专业技能还不够，你还需要财商技能，推销技能才可能获得工作、事业和经济上的成功。关于这一点，我从博士导师那里也学到了类似的知识。想要在一个领域成功，不论工业，学术或者商业，推销的能力是至关重要的。我曾经也对这样的观点不屑一顾，认为是金子就会发光。可是即使是真的金子，也要让别人看见你的光。 关于管理理论，作者提了这样一句话：工人付出最大努力以免于被解雇，而雇主提供最低工资以防止工人辞职。当然，这里翻译有点不好，更准确的说法应该是“雇主付给工人最低但不会让其辞职的工资”。在一份工作中，工资固然重要，但更重要的是你能学习到什么样的新知识。 克服困难作者指出，仅仅拥有财经会计知识并不足以保证经济上的成功。还需要克服以下的一些困难： 恐惧：每个人都恐惧失去金钱，所以有一些不敢投资。但这个恐惧本身不是问题，问题是如何面对这种恐惧以及如何处理投资上的失败。作者也退了一步指出，如果确实害怕损失金钱，那么早点开始储蓄并找一个靠谱的财务咨询也是可行的。失败是学习和成功必不可少的一个环节 怀疑：我们的观点信念很容易受到周围人的影响，即使这些影响是不理性的。“愤世者抱怨现实，而成功者分析现实”。 懒惰：懒惰的思想会告诉你“我们做不到”，但我们要积极思考“我们怎么样才能做到？”。作者认为适当的贪婪可以帮助人们改变懒惰。 习惯：作者阐述了习惯的重要性。其中一个例子是养成良好的理财习惯：“先支付给自己”。 自负：承认自己不会的东西，虚心请教他人。我们懂得的东西会给我们带来财富，而我们不明白的东西会导致我们亏损。 开始行动作者列出了10个步骤来帮助我们开发财商： 精神力量可以帮我们持之以恒。 做自己的选择，不仅仅是在工作上，在个人经济问题上更要如此。 慎重地选择自己的朋友，但财务状况不应该是选择朋友的标准。“三人行，必有我师”。 学习的力量。你学习的知识决定了你是一个什么样的人。同时记住：当你学到一个东西的时候，这个东西已经过时了。 自律，你首先要控制自己，才能控制其他人事物。作者列举了三个重要的管理技能：个人时间管理，人事管理和现金流管理。 给经纪人优厚的报酬，这样你才能雇佣到优秀的人为你工作并得到好的建议。 关注投资回报率和收回时限。 利用消费的欲望来刺激自己去投资并用回报的部分来消费，而不是贷款消费。 利用榜样的力量来刺激自己。 先予后取。慷慨对人，别人才会对你慷慨。","link":"/2020/03/21/Rich-Dad-Poor-Dad/"},{"title":"Grover Search as a Naturally Occurring Phenomenon","text":"A few days ago, when I was browsing papers recently accepted by Phys. Rev. Lett. I noticed an interesting article Grover Search as a Naturally Occurring Phenomenon, which has just been published online today. I found this work really very fascinating, so I write this short note describing the work. A short summaryThe idea is quite simple. The authors have studied a single-particle discrete-time Quantum walk (QW) on certain lattice geometry and find that the particle tends to localize around the topological defects in $O(\\sqrt{N})$ steps with a probability $O(1/log~N)$. If you are familiar with the Grover’s algorithm and consider the problem as the single particle searching for the defects on a large library of lattice sites, it looks like the fermion is doing Grover’s search! Two things are extremely important here: In Grover’s algorithm, the oracle, or the so-called diffusion operator, is repeated $O(\\sqrt{N})$ time. However, the free-propagating particle on the lattice knows nothing about the oracle! While a successful demonstration of Grover’s algorithm on a quantum computer (beating classical limits) is not possible right now, can we turn the way around and use the QW to simulate a Grover search in a gigantic database? ResultsIn this work, the authors have focused on a class of QW called Dirac QW in a 2D square or triangle lattice. While the lattice geometry is not essential here, the Dirac QW means that the QW can be effectively described by the Dirac Hamiltonian $$p_x\\sigma_x+p_y\\sigma_y+m_z\\sigma_z$$, where $\\sigma_i$ denotes Pauli matrices. The defect studied in this work is mainly vacancy, namely, there are few sites missing in the lattice. With the above preliminaries, the quantum dynamics can be simulated with any given initial state. The authors prepare the initial state with a uniform distribution on both real and spin space. The author first measure the probability distribution around a defect with radius 2 and find it a periodic function over time. This is also a characteristic feature of Grover’s algorithm. The authors then carefully measure the scaling of time and localization probability to $N$, which are consistent with that of Grover’s algorithm. DiscussionsFinally, the author also throws a profound question: while QW can be linked to both Grover’s algorithm and Dirac fermions, does this suggest that the Dirac fermion can really perform Grover’ algorithm naturally? My personal wondering is that, if so, does this suggest that Nature computes in a quantum-computing way as we do now? Reference Grover Search as a Naturally Occurring Phenomenon Grover’s algorithm Quantum walk","link":"/2020/05/05/Grover-Search-in-Nature/"},{"title":"Creation and manipulation of quantized vortices in Bose-Einstein condensates using reinforcement learning","text":"I came cross the work Creation and manipulation of quantized vortices in Bose-Einstein condensates using reinforcement learning a few months ago and found it quite interesting. In this work, the author uses reinforcement learning to control the quantum dynamics of a non-linear Bose-Einstein condensates (BECs). A reinforcement-learning-based optimization of quantum control of a superconducting qubit system is discussed in a previous note AlphaZero explores global optimization of quantum dynamics in superconducting circuit QED. Personally, I believe that cold atom systems like BECs provide accessible platforms for testing machine learning algorithms in physics since the order parameter of the condensate is nothing but a linear superposition of different plane-wave states. Especially, higher-momentum or higher-energy states are less likely to be involved in most physical processes. The BEC basically states a fairly less complicated nonlinear system even with contact interaction or dipolar interaction. Model and MethodThe author considers a simple model, where a trapped BEC with contact interaction is subject to a Gaussian potential so that its effective Hamiltonian reads$$\\mathcal{H}=-\\frac{\\hbar^2}{2m}\\nabla^2+V_{trap}+V_G+g\\vert\\psi\\vert^2$$, where $V_{trap}$ represents a harmonic trap and $V_G$ is the time-dependent Gaussian potential. Here, the author assumes that both the amplitude $A(t)&gt;0$ and centers $\\xi(t)$ and $\\eta(t)$ along $x$ and $y$ are control parameters. The reinforcement learning process can be summarized as following. The environment is basically the BEC simulator (numerical simulation of GP equation), which takes input as the the Gaussian potential profile in time domain and outputs the final state of the BEC. The agent is then fed with BEC order parameters (specifically, the density distribution $\\vert\\psi\\vert^2$ and flux distribution $\\psi^\\ast\\nabla\\psi-\\psi\\nabla\\psi^\\ast$) as well as corresponding rewards and take actions to obtain a new control signal. The agent is trained to optimize the reward function (namely, the absolute value of overlap integral between current state and target state), leading to the desired preparation of any state of the BEC. Learning algorithmFor the agent, it gets the reward $r_t$ from the environment (the simulator), which is computed using the current state $s_t$, and determines the action $a_t$ on the environment. The agent aims to minimize the discounted cumulative reward $\\sum_n\\gamma^nr_{t+n\\Delta t}$, where $0&lt;\\gamma&lt;1$ is the discount rate and $\\Delta t$ is time-evolution step. The real space is sampled by 64 $\\times$ 64 points and the density distribution, the flux and the Gaussian potential are fed into a deep convolutional neural network (CNN) with four convolutional layers and two fully-connected layers. The CNN outputs six values $Q(s_t,a),a=0,1,…,5$ and the agent determines the action $a_t$ through a $\\epsilon$-greedy policy. Namely, it generates a radom number $0\\leq r&lt;1$ and take a random choice if $r&lt;\\epsilon$, otherwise, the agent takes the action $a$ with maximum $Q(s_t,a)$. It is clear that $\\epsilon$ determines the level of explorations. In the implementation, $\\epsilon$ is linearly decreased from 1 to 0.1 in the first 50000 steps and remains a constant afterwards. In practice, the six possible actions are $\\xi\\to\\xi\\pm\\delta\\xi$, $\\eta\\to\\eta\\pm\\delta\\eta$ and $A\\to A\\pm\\delta A$. The training process of the CNN is followed. A queue of 50000 sets of data $(s_t,a_t,r_t,s_{t+\\Delta t})$ is maintained. Once the queue reaches its maximum length, 32 sets of data are taken randomly and the network is trained using gradients of Huber loss. The author keeps two copies of the CNN, the origin one is used to generate $Q$ and it is copied to a target CNN every 1000 steps. The target CNN is used to update the Huber loss in the training process. The author also kindly includes a pseudocode in the work to describe the algorithm, which is fairly easy to follow. ResultsFinally, the author applies the algorithm and good results for both 2D and 3D systems. The author focuses on the preparation of vertex state but it looks like the method is general for other states. However, it looks like in 2D, the final states obtained by the agent is not in perfect agreement with the target state. I suspect that on one hand, the learning algorithm remains to be optimized and on the other hand, this is a dynamical process after all and the author only allows 500 steps towards to the final state. It’s also unclear how non-linear interactions affects the performance of the algorithm. Reference Creation and manipulation of quantized vortices in Bose-Einstein condensates using reinforcement learning GP equation - Wikipedia","link":"/2020/05/28/Reinforcement-learning-vortices-BEC/"},{"title":"罗翔说（中国）刑法笔记","text":"最近听说很火的罗翔老师也入住B站了，开了账号罗翔说刑法。于是火速前去围观，顺便做了点学习笔记。 我们到底为什么要做一个诚信的人？ 诚信带来好处所以遵守，属于功利主义。 诚信是对的所以遵守，属于道德主意上两点都有短板，一是，长远是多远，不确定性强。二是，太过教条，往往显得虚伪伪善。 柏拉图调和主义，调和道德主义和功利主义，如无穷远的相交平行线。 道德功利主义，用道德主义进行结果比较来判断好坏。 没有道德调控的功利主义会形成相对主义，相对主义是一切罪恶的源头。一定要接受对立立场，接受多元道德主义。 买了假烟送领导，卖烟的人倒贴了60元？我国刑法第140条到148条规定了9种生产销售伪劣商品类罪。140条定义了基本最，销售金额达到5万元则构成犯罪。如果存有15万元以上货物，即可定未遂罪。注意与诈骗罪的区分。在诈骗罪中，被害人一定会陷入某种认知错误。诈骗罪只需要涉案金额达到3000元，即可定罪。惩罚性赔款：价款的10倍或者损害金额的3倍。 你采伐了你不知道是珍稀植物的植物，犯法吗？事实认识错误：我以为是一株小草，其实是珍稀兰花——不构成本罪（可参见杨正明盗伐国家珍稀树木案）。规范认识错误：我知道这是珍稀的兰花，但我不知道采它是犯罪——构成本罪。以大众的常识来判断。 给树浇水还要坐牢？植树节讲讲张三和树的故事故意浇水（开水或过量浇水）导致树木死亡，属于故意破坏财物罪。售卖处理后很快死亡的花草树木，属于生产销售伪劣产品罪。一级珍贵树种不可交易，如水杉（我国8种一级珍贵树种之一）；二级珍贵树种需要合法文件才能交易；具有历史意义的树木是受法律保护的；加工水杉也属于犯罪行为，判决3年以下有期徒刑，严重者最高可判处7年。 附录： 8种一级保护树木1、水杉：过去认为早已绝灭，1941年中国植物学者在四川万县谋道溪（今称磨刀溪）首次发现这一闻名中外古老珍稀孑遗树种。2、珙桐：被列为国家一级重点保护野生植物，为中国特有的单属植物，属孑遗植物，也是全世界著名的观赏植物。3、金花茶：是国家一级保护植物之一。金花茶的花金黄色，耀眼夺目，仿佛涂着一层蜡，晶莹而油润，似有半透明之感。4、台湾杉：是分布在中亚热带季风气候区的一种常绿乔木，为第三纪古热带植物区孑遗植物，属于国家一级保护植物，它的树皮淡灰褐色，裂成不规则长条形，树冠成锥形，为中国台湾的主要用材树种之一。5、银杉：为中国特产的稀有树种，生于海拔940~1870米地带的局部山区，如阔叶林中和山脊地带等。分布于中国广西、湖南、重庆、湖北、贵州等等。6、望天树：别名擎天树，木材坚硬、耐用、耐腐性强，不易受虫蛀；材色褐黄色，无特殊气味，纹理直，结构均匀，加工容易，刨切面光滑，花纹美观，为制造各种家具的高级用材。7、桫椤：是唯一的木本蕨类植物，极其珍贵，堪称国宝，被众多国家列为一级保护的濒危植物,有“活化石”之称。8、金钱松：是在中国长江中下游少数地区幸存下来的珍贵植物，它因分布零星，个体稀少，结实有明显的间歇性，而亟待保护。","link":"/2020/03/10/Luo-xiang-chinese-law/"},{"title":"小白如何安排健身计划","text":"跟我一样的健身小白，在脱离大腿（大神/教练）之后，一个非常伤脑筋的事情就是如何安排自己的健身计划。一个比较方便的途径是在网上搜索一些大神们的计划，照葫芦画瓢。而事实上，没有一个健身计划是通用的，适合所有人的。 因为个人的基因，体质，生活习惯，饮食习惯都是大相径庭的，所以盲目地追随大神们的训练计划对自己而言并不一定是最好的。健身小白一旦过了新手福利期，想要保持进步，就要制定一个适合自己的方案。我曾经也走了不少弯路，所以在这里整理了一些制定训练计划的准则，希望可以帮助和我一样的小白们更进一步。 力量训练不需要太多组数跟健美和肌肉塑形不一样，如果你的目标是力量提升，在训练中不应该追求高组数。一个动作2~3组热身，2~3组锻炼即可。一次训练的时间也应该控制在45分钟到1小时内，如果状态很好，可以适当延长，但是不推荐超过1个半小时。 PS：如果运动1小时之后还觉得不够，有如下几种可能性：1）你已经到了出神入化的地步了，2）训练重量偏小或每组次数过少以及3）组间休息过长（比如：刷太久微博/朋友圈/FB等等）。 重量和每组次数的选取如果记1 RM的重量为极限重量的话： 6 RM以下，极限重量85%以上的强度被认为是⾼强度，该强度下，健⾝者会优先发展绝对⼒量。 7-20 RM以内，极限重量的60-85%被认为是中等强度，该强度下，健⾝者会优先发展肌肥⼤。 20 RM以上，极限重量60%以下的强度被认为是低强度，该强度下，健⾝者会优先发展肌⾁耐⼒。 PS：不要过于追求大重量和次数，质量高于数量是力量的奥义。保证动作的标准性既能让训练事半功倍，还能减少受伤的概率。PPS：新手在测极限重量的时候，最好有人陪伴。一些动作如深蹲和卧推，几百磅的重量一旦失控，后果不堪设想。PPPS：新手不要过于频繁地冲击和测量极限重量。 周训练组数选取 维持量指的就是你每周维持现有的肌⾁量应当达到的最低训练量，通常是5-8组。这意味着如果你想要维持⽬前胸肌的肌⾁量，⼀周之内，你只要进⾏平常训练重量的5-8组卧推/俯卧撑等胸部训练动作就够了。低于这个区间，你的肌⾁会流失，⾼于这个区间，你的肌⾁会增⻓。 最低有效量就是开始出现增肌效果的最低训练量，通常在8-12组。每周训练8-12组胸肌，你的胸肌就 会开始缓慢地增⻓。 最⾼适应量就是增肌效果最好的训练量，在最低效量和最⾼恢复量之间，通常在12-18组。 最⾼恢复量就是可以承受的最⾼训练量，通常在20组左右。 附录福利：个人比较喜欢上下肢分化训练（看文章图片），曾经看到过一个不错的上肢训练计划example（可能是从小铁馆看来得，但具体记不清），在此分享给大家。当然，还是推荐大家做一些改动，让计划适合自己的需求。 上肢热⾝: 器械夹胸、俯仰杠铃划船、坐姿w。 上肢⽇1: 杠铃卧推4组5次、反握引体4组8次、哑铃肩推4组8次、哑铃划船3组10次、上斜⻜⻦3组10次、侧平举3组10次。 上肢⽇2: 哑铃卧推4组5次、背部下拉4组8次、杠铃肩推4组8次、坐姿划船4组8次、上斜卧推4组5次、前平举3组10次。","link":"/2019/07/09/Gym-make-your-training-plan/"},{"title":"健身学习资料","text":"运动与健身本身也是一门科学。想要安全健身，快速进步，相关的理论知识也是必不可少的。 动作讲解 热身与拉伸 静态拉伸动作大全 （干货） 上肢动作 引体向上的入门与进阶 下肢动作 如何做臀桥才不会过度“靠腰”？ 全身动作 高翻动作技术全解 跳绳教学指南, 跳绳双摇 综合 陈柏龄的动作讲解：深蹲，卧推，硬拉和其他 增肌减脂总想兼得？试试这个训练组合 运动损伤和康复 宽握Lats Pull可能导致肩部损伤 远离运动猝死，这些信息你必须了解 对背痛有益的运动以及应避免的运动 减脂还未成功，膝痛却先到来？","link":"/2019/07/30/Gym-materials/"},{"title":"Vaccine won&#39;t protect you from all the COVID variants","text":"A recent study shows that vaccines are not able to keep you safe from different variants of COVID. Recently, I came across a publication Multiple SARS-CoV-2 variants escape neutralization by vaccine-induced humoral immunity on CELL, a top journal of “Biochemistry &amp; Molecular Biology”. In this work, the authors evaluated the neutralization potency of 99 individuals that received one or two doses of either BNT162b2 (manufactured by Pfizer) or mRNA-1273 (manufactured by Moderna) vaccines against pseudoviruses representing 10 globally circulating strains of SARS-CoV-2. For these who are not very familiar with the terminology, a good neutralization means that the vaccine is efficient to the virus. However, the results show that five of the ten pseudoviruses, harboring receptor-binding domain mutations, including K417N/T, E484K, and N501Y, were highly resistant to neutralization. This suggests that even both of these vaccines demonstrated &gt;94% efficacy at preventing COVID in phase III clinical studies performed in late 2020 in multiple countries, they won’t be as effective to certain COVID variants. Regardless, we should all get the vaccine if possible as it still protects us from some of the virus. Moreover, the current vaccines may provide clinical benefit against variants that exhibit poor cross-neutralization by reducing COVID disease severity. The most important thing is that we should still keep the masks on and wash hands regularly even after we get the vaccine. 中文一句话版 最近，一篇发表在生物学顶级期刊《细胞》上的文章指出，现有的辉瑞以及莫德纳疫苗虽然在第三期临床实验上被证实有超过94%的有效率，但是对于个别的变异病毒体可能是无效的。","link":"/2021/04/11/Coivd-variants/"},{"title":"房贷与货币的时间价值（Mortgage and the time value of money）","text":"知乎上看到一个问题“30年的房贷利息几乎等于本金，你是怎么看的？”。虽然我们都知道因为通膨，问题并不能如此简单粗暴地看待，不过这里最高赞的回答还是深入浅出，所以在此系统地整理了一下。 首先，要指出的一点是：仅仅观察房贷的利息是没有意义的。这是因为各年的利息不能简单的加起来，而要折现。换句话说，价格不是一个固定的参考系。一个简单例子就是大家多少都听说过的通膨。 关于通膨，有一个国际通用的所谓的“The Big Mac index”，这里“Big Mac”即麦当劳经典巨无霸汉堡。参考下图，我们发现巨无霸在2000年的时候是9.9元（图中为美元，此处已经折算成人民币），2008年的时候是12.5元，2015年的时候是17.2元，而2020的时候是21.5元。这里需要注意的一点是，不同的物品，通货膨胀是不一样的。 正是因为每年的物价都不一样，所以当我们比较不同年份的金钱的时候需要打一个折扣，即所谓的货币的时间价值（the Time Value of Money， TVM）。最简单的做法就是选一个基准年份$t_0$，随后每个年份$t_1\\geq t_0$的价格都除以$(1+r)^{(t_1-t_0)}$。这里$r$就是所谓的折现率，我们简单假设它是一个很小的正实数且是一个常数（不随年份变化）。 上图来自维基百科，就画出了未来某个年份（横轴）1000元对应现在的价值。假设折现率$r=0.03$，那么25年后的1000元相当于现在的$1000/(1+0.03)^{25}\\approx 447.61$元，50年后的1000元相当于现在的228.11元，而100年之后的1000元只相当于现在的50元了。 因此，如果假设贷款利率也是$0.04$的话，那么今年借100万，30年后需要还324.34万，即大家常说的100万贷款和224.34万利息。但是根据上面通膨的折现算法，30年后的324.34万元就等于今天的100万，一分钱不多，一分钱不少。换句话说： 如果折现率小于房贷利率，那还款额折算到2020年大于100万，钱越借还得越多。 如果折现率大于房贷利率，那还款额折算到2020年小于100万，钱越借还得越少。 关键在于：钱本身没有价值，而是一个浮动的虚的参照。 既然钱只是一个参照，我们也可以用其他东西来参照，比如说，巨无霸。比如一个人在2008年借了100万，即8万的巨无霸。按照贷款利率$0.04$来算，2015年需要还钱131.16万，对应7.6万个巨无霸。也就说这里越借钱反而约富有。 再举一个例子，北京市1992年的平均年薪为3402。如果当年你借了10万元贷款，差不多相当于29.4年的收入。假设贷款分25年还清，利率为$0.045$。到期需要偿还约30万。而2017年北京市平均工资是101599，也就说偿还总金额仅相当于当年3年的年薪。 Reference 30年的房贷利息几乎等于本金，你是怎么看的？ The Big Mac Index May Be Telling The Truth About Inflation Wiki - Time value of money 北京市历年社会平均工资（2019版）","link":"/2021/03/01/Mortgage-and-TVM/"}],"tags":[{"name":"Physics","slug":"Physics","link":"/tags/Physics/"},{"name":"Study","slug":"Study","link":"/tags/Study/"},{"name":"English","slug":"English","link":"/tags/English/"},{"name":"Quotes","slug":"Quotes","link":"/tags/Quotes/"},{"name":"Gym","slug":"Gym","link":"/tags/Gym/"},{"name":"Research","slug":"Research","link":"/tags/Research/"},{"name":"Reading","slug":"Reading","link":"/tags/Reading/"},{"name":"Quantum Computing","slug":"Quantum-Computing","link":"/tags/Quantum-Computing/"},{"name":"Machine Learning","slug":"Machine-Learning","link":"/tags/Machine-Learning/"},{"name":"Readings","slug":"Readings","link":"/tags/Readings/"},{"name":"COVID","slug":"COVID","link":"/tags/COVID/"},{"name":"Finance","slug":"Finance","link":"/tags/Finance/"}],"categories":[{"name":"Physics","slug":"Physics","link":"/categories/Physics/"},{"name":"Condensed Matter Physics","slug":"Physics/Condensed-Matter-Physics","link":"/categories/Physics/Condensed-Matter-Physics/"},{"name":"Language","slug":"Language","link":"/categories/Language/"},{"name":"English","slug":"Language/English","link":"/categories/Language/English/"},{"name":"Chinese","slug":"Language/Chinese","link":"/categories/Language/Chinese/"},{"name":"AMO Physics","slug":"Physics/AMO-Physics","link":"/categories/Physics/AMO-Physics/"},{"name":"Book notes","slug":"Book-notes","link":"/categories/Book-notes/"},{"name":"Quantum Computing","slug":"Physics/Quantum-Computing","link":"/categories/Physics/Quantum-Computing/"},{"name":"Computer Science","slug":"Computer-Science","link":"/categories/Computer-Science/"},{"name":"Quantum Computing","slug":"Computer-Science/Quantum-Computing","link":"/categories/Computer-Science/Quantum-Computing/"},{"name":"Machine Learning","slug":"Computer-Science/Machine-Learning","link":"/categories/Computer-Science/Machine-Learning/"},{"name":"Popular Science","slug":"Popular-Science","link":"/categories/Popular-Science/"},{"name":"Play","slug":"Play","link":"/categories/Play/"},{"name":"Gym","slug":"Play/Gym","link":"/categories/Play/Gym/"}]}